NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* ENABLE @Bits 0..1 : Enable or disable AAR */
  #define AAR_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define AAR_ENABLE_ENABLE_Msk (0x3UL << AAR_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define AAR_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define AAR_ENABLE_ENABLE_Max (0x3UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define AAR_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disable                                                              */
  #define AAR_ENABLE_ENABLE_Enabled (0x3UL)          /*!< Enable                                                               */


/* AAR_MAXRESOLVED: Maximum number of IRKs to resolve */
  #define AAR_MAXRESOLVED_ResetValue (0x00000001UL)  /*!< Reset value of MAXRESOLVED register.                                 */

/* MAXRESOLVED @Bits 0..11 : The maximum number of IRKs to resolve */
  #define AAR_MAXRESOLVED_MAXRESOLVED_Pos (0UL)      /*!< Position of MAXRESOLVED field.                                       */
  #define AAR_MAXRESOLVED_MAXRESOLVED_Msk (0xFFFUL << AAR_MAXRESOLVED_MAXRESOLVED_Pos) /*!< Bit mask of MAXRESOLVED field.     */
  #define AAR_MAXRESOLVED_MAXRESOLVED_Min (0x001UL)  /*!< Min value of MAXRESOLVED field.                                      */
  #define AAR_MAXRESOLVED_MAXRESOLVED_Max (0xFFFUL)  /*!< Max size of MAXRESOLVED field.                                       */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           AXONS                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct AXONS ======================================================= */
/**
  * @brief Neural processing unit (NPU)
  */
  typedef struct {                                   /*!< AXONS Structure                                                      */
    __IM uint32_t RESERVED[256];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000400) Enable AXONS.                                         */
    __IM uint32_t STATUS;                            /*!< (@ 0x00000404) Status                                                */
  } NRF_AXONS_Type;                                  /*!< Size = 1032 (0x408)                                                  */

/* AXONS_ENABLE: Enable AXONS. */
  #define AXONS_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* EN @Bit 0 : Enable */
  #define AXONS_ENABLE_EN_Pos (0UL)                  /*!< Position of EN field.                                                */
  #define AXONS_ENABLE_EN_Msk (0x1UL << AXONS_ENABLE_EN_Pos) /*!< Bit mask of EN field.                                        */
  #define AXONS_ENABLE_EN_Min (0x0UL)                /*!< Min enumerator value of EN field.                                    */
  #define AXONS_ENABLE_EN_Max (0x1UL)                /*!< Max enumerator value of EN field.                                    */
  #define AXONS_ENABLE_EN_Disabled (0x0UL)           /*!< AXONS disabled (powered off).                                        */
  #define AXONS_ENABLE_EN_Enabled (0x1UL)            /*!< AXONS enabled.                                                       */


/* AXONS_STATUS: Status */
  #define AXONS_STATUS_ResetValue (0x00000000UL)     /*!< Reset value of STATUS register.                                      */

/* READY @Bit 0 : AXONS ready */
  #define AXONS_STATUS_READY_Pos (0UL)               /*!< Position of READY field.                                             */
  #define AXONS_STATUS_READY_Msk (0x1UL << AXONS_STATUS_READY_Pos) /*!< Bit mask of READY field.                               */
  #define AXONS_STATUS_READY_Min (0x0UL)             /*!< Min enumerator value of READY field.                                 */
  #define AXONS_STATUS_READY_Max (0x1UL)             /*!< Max enumerator value of READY field.                                 */
  #define AXONS_STATUS_READY_NotReady (0x0UL)        /*!< AXONS is not yet accessible                                          */
  #define AXONS_STATUS_READY_Ready (0x1UL)           /*!< AXONS is accessible                                                  */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           CACHE                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct CACHE_PROFILING ================================================== */
/**
  * @brief PROFILING [CACHE_PROFILING] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) Enable the profiling counters.                        */
  __OM  uint32_t  CLEAR;                             /*!< (@ 0x00000004) Clear the profiling counters.                         */
  __IM  uint32_t  HIT;                               /*!< (@ 0x00000008) The cache hit counter for cache region.               */
  __IM  uint32_t  MISS;                              /*!< (@ 0x0000000C) The cache miss counter for cache region.              */
  __IM  uint32_t  LMISS;                             /*!< (@ 0x00000010) The cache line miss counter for cache region.         */
  __IM  uint32_t  READS;                             /*!< (@ 0x00000014) Number of reads for cache region.                     */
  __IM  uint32_t  WRITES;                            /*!< (@ 0x00000018) Number of writes for cache region.                    */
} NRF_CACHE_PROFILING_Type;                          /*!< Size = 28 (0x01C)                                                    */

/* CACHE_PROFILING_ENABLE: Enable the profiling counters. */
  #define CACHE_PROFILING_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                                */

