NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* CLOCK_EVENTS_LFCLKSTARTED: LFCLK source started */
  #define CLOCK_EVENTS_LFCLKSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LFCLKSTARTED register.                */

/* EVENTS_LFCLKSTARTED @Bit 0 : LFCLK source started */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Pos (0UL) /*!< Position of EVENTS_LFCLKSTARTED field.                  */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Msk (0x1UL << CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Pos) /*!<
                                                                            Bit mask of EVENTS_LFCLKSTARTED field.*/
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_LFCLKSTARTED field.    */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_LFCLKSTARTED field.    */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Generated (0x1UL) /*!< Event generated                                 */


/* CLOCK_EVENTS_DONE: Calibration of LFRC oscillator complete event */
  #define CLOCK_EVENTS_DONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_DONE register.                                */

/* EVENTS_DONE @Bit 0 : Calibration of LFRC oscillator complete event */
  #define CLOCK_EVENTS_DONE_EVENTS_DONE_Pos (0UL)    /*!< Position of EVENTS_DONE field.                                       */
  #define CLOCK_EVENTS_DONE_EVENTS_DONE_Msk (0x1UL << CLOCK_EVENTS_DONE_EVENTS_DONE_Pos) /*!< Bit mask of EVENTS_DONE field.   */
  #define CLOCK_EVENTS_DONE_EVENTS_DONE_Min (0x0UL)  /*!< Min enumerator value of EVENTS_DONE field.                           */
  #define CLOCK_EVENTS_DONE_EVENTS_DONE_Max (0x1UL)  /*!< Max enumerator value of EVENTS_DONE field.                           */
  #define CLOCK_EVENTS_DONE_EVENTS_DONE_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define CLOCK_EVENTS_DONE_EVENTS_DONE_Generated (0x1UL) /*!< Event generated                                                 */


/* CLOCK_EVENTS_XOTUNED: HFXO tuning is done. XOTUNED is generated after TASKS_XOSTART or after TASKS_XOTUNE has completed */
  #define CLOCK_EVENTS_XOTUNED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_XOTUNED register.                          */

/* EVENTS_XOTUNED @Bit 0 : HFXO tuning is done. XOTUNED is generated after TASKS_XOSTART or after TASKS_XOTUNE has completed */
  #define CLOCK_EVENTS_XOTUNED_EVENTS_XOTUNED_Pos (0UL) /*!< Position of EVENTS_XOTUNED field.                                 */
  #define CLOCK_EVENTS_XOTUNED_EVENTS_XOTUNED_Msk (0x1UL << CLOCK_EVENTS_XOTUNED_EVENTS_XOTUNED_Pos) /*!< Bit mask of
                                                                            EVENTS_XOTUNED field.*/
  #define CLOCK_EVENTS_XOTUNED_EVENTS_XOTUNED_Min (0x0UL) /*!< Min enumerator value of EVENTS_XOTUNED field.                   */
  #define CLOCK_EVENTS_XOTUNED_EVENTS_XOTUNED_Max (0x1UL) /*!< Max enumerator value of EVENTS_XOTUNED field.                   */
  #define CLOCK_EVENTS_XOTUNED_EVENTS_XOTUNED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define CLOCK_EVENTS_XOTUNED_EVENTS_XOTUNED_Generated (0x1UL) /*!< Event generated                                           */


/* CLOCK_EVENTS_XOTUNEERROR: HFXO quality issue detected, XOTUNE is needed */
  #define CLOCK_EVENTS_XOTUNEERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_XOTUNEERROR register.                  */

/* EVENTS_XOTUNEERROR @Bit 0 : HFXO quality issue detected, XOTUNE is needed */
  #define CLOCK_EVENTS_XOTUNEERROR_EVENTS_XOTUNEERROR_Pos (0UL) /*!< Position of EVENTS_XOTUNEERROR field.                     */
  #define CLOCK_EVENTS_XOTUNEERROR_EVENTS_XOTUNEERROR_Msk (0x1UL << CLOCK_EVENTS_XOTUNEERROR_EVENTS_XOTUNEERROR_Pos) /*!< Bit
                                                                            mask of EVENTS_XOTUNEERROR field.*/
  #define CLOCK_EVENTS_XOTUNEERROR_EVENTS_XOTUNEERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_XOTUNEERROR field.       */
  #define CLOCK_EVENTS_XOTUNEERROR_EVENTS_XOTUNEERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_XOTUNEERROR field.       */
  #define CLOCK_EVENTS_XOTUNEERROR_EVENTS_XOTUNEERROR_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define CLOCK_EVENTS_XOTUNEERROR_EVENTS_XOTUNEERROR_Generated (0x1UL) /*!< Event generated                                   */


/* CLOCK_EVENTS_XOTUNEFAILED: HFXO tuning could not be completed */
  #define CLOCK_EVENTS_XOTUNEFAILED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_XOTUNEFAILED register.                */

/* EVENTS_XOTUNEFAILED @Bit 0 : HFXO tuning could not be completed */
  #define CLOCK_EVENTS_XOTUNEFAILED_EVENTS_XOTUNEFAILED_Pos (0UL) /*!< Position of EVENTS_XOTUNEFAILED field.                  */
  #define CLOCK_EVENTS_XOTUNEFAILED_EVENTS_XOTUNEFAILED_Msk (0x1UL << CLOCK_EVENTS_XOTUNEFAILED_EVENTS_XOTUNEFAILED_Pos) /*!<
                                                                            Bit mask of EVENTS_XOTUNEFAILED field.*/
  #define CLOCK_EVENTS_XOTUNEFAILED_EVENTS_XOTUNEFAILED_Min (0x0UL) /*!< Min enumerator value of EVENTS_XOTUNEFAILED field.    */
  #define CLOCK_EVENTS_XOTUNEFAILED_EVENTS_XOTUNEFAILED_Max (0x1UL) /*!< Max enumerator value of EVENTS_XOTUNEFAILED field.    */
  #define CLOCK_EVENTS_XOTUNEFAILED_EVENTS_XOTUNEFAILED_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define CLOCK_EVENTS_XOTUNEFAILED_EVENTS_XOTUNEFAILED_Generated (0x1UL) /*!< Event generated                                 */


/* CLOCK_EVENTS_XO24MSTARTED: XO24M started */
  #define CLOCK_EVENTS_XO24MSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_XO24MSTARTED register.                */

/* EVENTS_XO24MSTARTED @Bit 0 : XO24M started */
  #define CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_Pos (0UL) /*!< Position of EVENTS_XO24MSTARTED field.                  */
  #define CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_Msk (0x1UL << CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_Pos) /*!<
                                                                            Bit mask of EVENTS_XO24MSTARTED field.*/
  #define CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_XO24MSTARTED field.    */
  #define CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_XO24MSTARTED field.    */
  #define CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_Generated (0x1UL) /*!< Event generated                                 */


