NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* CLOCK_PUBLISH_XOSTARTED: Publish configuration for event XOSTARTED */
  #define CLOCK_PUBLISH_XOSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_XOSTARTED register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event XOSTARTED will publish to */
  #define CLOCK_PUBLISH_XOSTARTED_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define CLOCK_PUBLISH_XOSTARTED_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_XOSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define CLOCK_PUBLISH_XOSTARTED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define CLOCK_PUBLISH_XOSTARTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_XOSTARTED_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_XOSTARTED_EN_Msk (0x1UL << CLOCK_PUBLISH_XOSTARTED_EN_Pos) /*!< Bit mask of EN field.                  */
  #define CLOCK_PUBLISH_XOSTARTED_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XOSTARTED_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XOSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define CLOCK_PUBLISH_XOSTARTED_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* CLOCK_PUBLISH_PLLSTARTED: Publish configuration for event PLLSTARTED */
  #define CLOCK_PUBLISH_PLLSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_PLLSTARTED register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event PLLSTARTED will publish to */
  #define CLOCK_PUBLISH_PLLSTARTED_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define CLOCK_PUBLISH_PLLSTARTED_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_PLLSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define CLOCK_PUBLISH_PLLSTARTED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define CLOCK_PUBLISH_PLLSTARTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_PLLSTARTED_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_PLLSTARTED_EN_Msk (0x1UL << CLOCK_PUBLISH_PLLSTARTED_EN_Pos) /*!< Bit mask of EN field.                */
  #define CLOCK_PUBLISH_PLLSTARTED_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_PLLSTARTED_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_PLLSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define CLOCK_PUBLISH_PLLSTARTED_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* CLOCK_PUBLISH_LFCLKSTARTED: Publish configuration for event LFCLKSTARTED */
  #define CLOCK_PUBLISH_LFCLKSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_LFCLKSTARTED register.              */

/* CHIDX @Bits 0..7 : DPPI channel that event LFCLKSTARTED will publish to */
  #define CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_LFCLKSTARTED_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_LFCLKSTARTED_EN_Msk (0x1UL << CLOCK_PUBLISH_LFCLKSTARTED_EN_Pos) /*!< Bit mask of EN field.            */
  #define CLOCK_PUBLISH_LFCLKSTARTED_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_LFCLKSTARTED_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_LFCLKSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define CLOCK_PUBLISH_LFCLKSTARTED_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* CLOCK_PUBLISH_DONE: Publish configuration for event DONE */
  #define CLOCK_PUBLISH_DONE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DONE register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event DONE will publish to */
  #define CLOCK_PUBLISH_DONE_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define CLOCK_PUBLISH_DONE_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_DONE_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define CLOCK_PUBLISH_DONE_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define CLOCK_PUBLISH_DONE_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_DONE_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_DONE_EN_Msk (0x1UL << CLOCK_PUBLISH_DONE_EN_Pos) /*!< Bit mask of EN field.                            */
  #define CLOCK_PUBLISH_DONE_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_DONE_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_DONE_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define CLOCK_PUBLISH_DONE_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* CLOCK_PUBLISH_XOTUNED: Publish configuration for event XOTUNED */
  #define CLOCK_PUBLISH_XOTUNED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_XOTUNED register.                        */

