NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* ENABLE8 @Bit 8 : Enable the lock for SEED[8] */
  #define CRACEN_SEEDLOCK_ENABLE8_Pos (8UL)          /*!< Position of ENABLE8 field.                                           */
  #define CRACEN_SEEDLOCK_ENABLE8_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE8_Pos) /*!< Bit mask of ENABLE8 field.                   */
  #define CRACEN_SEEDLOCK_ENABLE8_Min (0x0UL)        /*!< Min enumerator value of ENABLE8 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE8_Max (0x1UL)        /*!< Max enumerator value of ENABLE8 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE8_Disabled (0x0UL)   /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE8_Enabled (0x1UL)    /*!< Lock enabled.                                                        */

/* ENABLE9 @Bit 9 : Enable the lock for SEED[9] */
  #define CRACEN_SEEDLOCK_ENABLE9_Pos (9UL)          /*!< Position of ENABLE9 field.                                           */
  #define CRACEN_SEEDLOCK_ENABLE9_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE9_Pos) /*!< Bit mask of ENABLE9 field.                   */
  #define CRACEN_SEEDLOCK_ENABLE9_Min (0x0UL)        /*!< Min enumerator value of ENABLE9 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE9_Max (0x1UL)        /*!< Max enumerator value of ENABLE9 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE9_Disabled (0x0UL)   /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE9_Enabled (0x1UL)    /*!< Lock enabled.                                                        */

/* ENABLE10 @Bit 10 : Enable the lock for SEED[10] */
  #define CRACEN_SEEDLOCK_ENABLE10_Pos (10UL)        /*!< Position of ENABLE10 field.                                          */
  #define CRACEN_SEEDLOCK_ENABLE10_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE10_Pos) /*!< Bit mask of ENABLE10 field.                */
  #define CRACEN_SEEDLOCK_ENABLE10_Min (0x0UL)       /*!< Min enumerator value of ENABLE10 field.                              */
  #define CRACEN_SEEDLOCK_ENABLE10_Max (0x1UL)       /*!< Max enumerator value of ENABLE10 field.                              */
  #define CRACEN_SEEDLOCK_ENABLE10_Disabled (0x0UL)  /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE10_Enabled (0x1UL)   /*!< Lock enabled.                                                        */

/* ENABLE11 @Bit 11 : Enable the lock for SEED[11] */
  #define CRACEN_SEEDLOCK_ENABLE11_Pos (11UL)        /*!< Position of ENABLE11 field.                                          */
  #define CRACEN_SEEDLOCK_ENABLE11_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE11_Pos) /*!< Bit mask of ENABLE11 field.                */
  #define CRACEN_SEEDLOCK_ENABLE11_Min (0x0UL)       /*!< Min enumerator value of ENABLE11 field.                              */
  #define CRACEN_SEEDLOCK_ENABLE11_Max (0x1UL)       /*!< Max enumerator value of ENABLE11 field.                              */
  #define CRACEN_SEEDLOCK_ENABLE11_Disabled (0x0UL)  /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE11_Enabled (0x1UL)   /*!< Lock enabled.                                                        */


/* CRACEN_PROTECTEDRAMLOCK: Lock the access to the protected RAM. */
  #define CRACEN_PROTECTEDRAMLOCK_ResetValue (0x00000000UL) /*!< Reset value of PROTECTEDRAMLOCK register.                     */

/* ENABLE @Bit 0 : Enable the lock */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Pos (0UL)   /*!< Position of ENABLE field.                                            */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Msk (0x1UL << CRACEN_PROTECTEDRAMLOCK_ENABLE_Pos) /*!< Bit mask of ENABLE field.      */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                                */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                                */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Disabled (0x0UL) /*!< Lock disabled.                                                  */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Enabled (0x1UL) /*!< Lock enabled.                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        CRACENCORE                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================= Struct CRACENCORE_CRYPTMSTRDMA ============================================== */
/**
  * @brief CRYPTMSTRDMA [CRACENCORE_CRYPTMSTRDMA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  FETCHADDRLSB;                      /*!< (@ 0x00000000) Fetch Address Least Significant Word                  */
  __IOM uint32_t  FETCHADDRMSB;                      /*!< (@ 0x00000004) Fetch Address Most Significant Word                   */
  __IOM uint32_t  FETCHLEN;                          /*!< (@ 0x00000008) Fetch DMA Length (only used in direct mode)           */
  __IOM uint32_t  FETCHTAG;                          /*!< (@ 0x0000000C) Fetch User Tag (only used in direct mode)             */
  __IOM uint32_t  PUSHADDRLSB;                       /*!< (@ 0x00000010) Push Address Least Significant Word                   */
  __IOM uint32_t  PUSHADDRMSB;                       /*!< (@ 0x00000014) Push Address Most Significant Word                    */
  __IOM uint32_t  PUSHLEN;                           /*!< (@ 0x00000018) Push Length (only used in direct mode)                */
  __IOM uint32_t  INTEN;                             /*!< (@ 0x0000001C) Interrupt Enable mask                                 */
  __IOM uint32_t  INTENSET;                          /*!< (@ 0x00000020) Interrupt Set                                         */
  __IOM uint32_t  INTENCLR;                          /*!< (@ 0x00000024) Interrupt Clear                                       */
  __IOM uint32_t  INTSTATRAW;                        /*!< (@ 0x00000028) Interrupt Status Raw                                  */
  __IOM uint32_t  INTSTAT;                           /*!< (@ 0x0000002C) Interrupt Status                                      */
  __IOM uint32_t  INTSTATCLR;                        /*!< (@ 0x00000030) Interrupt Status Clear                                */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000034) Cryptomaster configuration                            */
  __IOM uint32_t  START;                             /*!< (@ 0x00000038) Start                                                 */
  __IOM uint32_t  STATUS;                            /*!< (@ 0x0000003C) Status                                                */
} NRF_CRACENCORE_CRYPTMSTRDMA_Type;                  /*!< Size = 64 (0x040)                                                    */

/* CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB: Fetch Address Least Significant Word */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB_ResetValue (0x00000000UL) /*!< Reset value of FETCHADDRLSB register.            */

/* FETCHADDRLSB @Bits 0..31 : Address */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB_FETCHADDRLSB_Pos (0UL) /*!< Position of FETCHADDRLSB field.                     */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB_FETCHADDRLSB_Msk (0xFFFFFFFFUL << CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB_FETCHADDRLSB_Pos)
                                                                            /*!< Bit mask of FETCHADDRLSB field.*/


/* CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB: Fetch Address Most Significant Word */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB_ResetValue (0x00000000UL) /*!< Reset value of FETCHADDRMSB register.            */

/* FETCHADDRMSB @Bits 0..31 : (unspecified) */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB_FETCHADDRMSB_Pos (0UL) /*!< Position of FETCHADDRMSB field.                     */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB_FETCHADDRMSB_Msk (0xFFFFFFFFUL << CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB_FETCHADDRMSB_Pos)
                                                                            /*!< Bit mask of FETCHADDRMSB field.*/


/* CRACENCORE_CRYPTMSTRDMA_FETCHLEN: Fetch DMA Length (only used in direct mode) */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHLEN_ResetValue (0x00000000UL) /*!< Reset value of FETCHLEN register.                    */

/* FETCHLEN @Bits 0..27 : Length of data block */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHLEN_FETCHLEN_Pos (0UL) /*!< Position of FETCHLEN field.                                 */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHLEN_FETCHLEN_Msk (0xFFFFFFFUL << CRACENCORE_CRYPTMSTRDMA_FETCHLEN_FETCHLEN_Pos) /*!< Bit
                                                                            mask of FETCHLEN field.*/

