NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* PWMREADY @Bit 29 : Read pending status of interrupt for event PWMREADY */
  #define GRTC_INTPEND0_PWMREADY_Pos (29UL)          /*!< Position of PWMREADY field.                                          */
  #define GRTC_INTPEND0_PWMREADY_Msk (0x1UL << GRTC_INTPEND0_PWMREADY_Pos) /*!< Bit mask of PWMREADY field.                    */
  #define GRTC_INTPEND0_PWMREADY_Min (0x0UL)         /*!< Min enumerator value of PWMREADY field.                              */
  #define GRTC_INTPEND0_PWMREADY_Max (0x1UL)         /*!< Max enumerator value of PWMREADY field.                              */
  #define GRTC_INTPEND0_PWMREADY_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND0_PWMREADY_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* CLKOUTREADY @Bit 30 : Read pending status of interrupt for event CLKOUTREADY */
  #define GRTC_INTPEND0_CLKOUTREADY_Pos (30UL)       /*!< Position of CLKOUTREADY field.                                       */
  #define GRTC_INTPEND0_CLKOUTREADY_Msk (0x1UL << GRTC_INTPEND0_CLKOUTREADY_Pos) /*!< Bit mask of CLKOUTREADY field.           */
  #define GRTC_INTPEND0_CLKOUTREADY_Min (0x0UL)      /*!< Min enumerator value of CLKOUTREADY field.                           */
  #define GRTC_INTPEND0_CLKOUTREADY_Max (0x1UL)      /*!< Max enumerator value of CLKOUTREADY field.                           */
  #define GRTC_INTPEND0_CLKOUTREADY_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define GRTC_INTPEND0_CLKOUTREADY_Pending (0x1UL)  /*!< Read: Pending                                                        */


/* GRTC_INTEN1: Enable or disable interrupt */
  #define GRTC_INTEN1_ResetValue (0x00000000UL)      /*!< Reset value of INTEN1 register.                                      */

/* COMPARE0 @Bit 0 : Enable or disable interrupt for event COMPARE[0] */
  #define GRTC_INTEN1_COMPARE0_Pos (0UL)             /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTEN1_COMPARE0_Msk (0x1UL << GRTC_INTEN1_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                        */
  #define GRTC_INTEN1_COMPARE0_Min (0x0UL)           /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTEN1_COMPARE0_Max (0x1UL)           /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTEN1_COMPARE0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE0_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE1 @Bit 1 : Enable or disable interrupt for event COMPARE[1] */
  #define GRTC_INTEN1_COMPARE1_Pos (1UL)             /*!< Position of COMPARE1 field.                                          */
  #define GRTC_INTEN1_COMPARE1_Msk (0x1UL << GRTC_INTEN1_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                        */
  #define GRTC_INTEN1_COMPARE1_Min (0x0UL)           /*!< Min enumerator value of COMPARE1 field.                              */
  #define GRTC_INTEN1_COMPARE1_Max (0x1UL)           /*!< Max enumerator value of COMPARE1 field.                              */
  #define GRTC_INTEN1_COMPARE1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE1_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE2 @Bit 2 : Enable or disable interrupt for event COMPARE[2] */
  #define GRTC_INTEN1_COMPARE2_Pos (2UL)             /*!< Position of COMPARE2 field.                                          */
  #define GRTC_INTEN1_COMPARE2_Msk (0x1UL << GRTC_INTEN1_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                        */
  #define GRTC_INTEN1_COMPARE2_Min (0x0UL)           /*!< Min enumerator value of COMPARE2 field.                              */
  #define GRTC_INTEN1_COMPARE2_Max (0x1UL)           /*!< Max enumerator value of COMPARE2 field.                              */
  #define GRTC_INTEN1_COMPARE2_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE2_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE3 @Bit 3 : Enable or disable interrupt for event COMPARE[3] */
  #define GRTC_INTEN1_COMPARE3_Pos (3UL)             /*!< Position of COMPARE3 field.                                          */
  #define GRTC_INTEN1_COMPARE3_Msk (0x1UL << GRTC_INTEN1_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                        */
  #define GRTC_INTEN1_COMPARE3_Min (0x0UL)           /*!< Min enumerator value of COMPARE3 field.                              */
  #define GRTC_INTEN1_COMPARE3_Max (0x1UL)           /*!< Max enumerator value of COMPARE3 field.                              */
  #define GRTC_INTEN1_COMPARE3_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE3_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE4 @Bit 4 : Enable or disable interrupt for event COMPARE[4] */
  #define GRTC_INTEN1_COMPARE4_Pos (4UL)             /*!< Position of COMPARE4 field.                                          */
  #define GRTC_INTEN1_COMPARE4_Msk (0x1UL << GRTC_INTEN1_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                        */
  #define GRTC_INTEN1_COMPARE4_Min (0x0UL)           /*!< Min enumerator value of COMPARE4 field.                              */
  #define GRTC_INTEN1_COMPARE4_Max (0x1UL)           /*!< Max enumerator value of COMPARE4 field.                              */
  #define GRTC_INTEN1_COMPARE4_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE4_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE5 @Bit 5 : Enable or disable interrupt for event COMPARE[5] */
  #define GRTC_INTEN1_COMPARE5_Pos (5UL)             /*!< Position of COMPARE5 field.                                          */
  #define GRTC_INTEN1_COMPARE5_Msk (0x1UL << GRTC_INTEN1_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field.                        */
  #define GRTC_INTEN1_COMPARE5_Min (0x0UL)           /*!< Min enumerator value of COMPARE5 field.                              */
  #define GRTC_INTEN1_COMPARE5_Max (0x1UL)           /*!< Max enumerator value of COMPARE5 field.                              */
  #define GRTC_INTEN1_COMPARE5_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE5_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE6 @Bit 6 : Enable or disable interrupt for event COMPARE[6] */
  #define GRTC_INTEN1_COMPARE6_Pos (6UL)             /*!< Position of COMPARE6 field.                                          */
  #define GRTC_INTEN1_COMPARE6_Msk (0x1UL << GRTC_INTEN1_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field.                        */
  #define GRTC_INTEN1_COMPARE6_Min (0x0UL)           /*!< Min enumerator value of COMPARE6 field.                              */
  #define GRTC_INTEN1_COMPARE6_Max (0x1UL)           /*!< Max enumerator value of COMPARE6 field.                              */
  #define GRTC_INTEN1_COMPARE6_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE6_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE7 @Bit 7 : Enable or disable interrupt for event COMPARE[7] */
  #define GRTC_INTEN1_COMPARE7_Pos (7UL)             /*!< Position of COMPARE7 field.                                          */
  #define GRTC_INTEN1_COMPARE7_Msk (0x1UL << GRTC_INTEN1_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field.                        */
  #define GRTC_INTEN1_COMPARE7_Min (0x0UL)           /*!< Min enumerator value of COMPARE7 field.                              */
  #define GRTC_INTEN1_COMPARE7_Max (0x1UL)           /*!< Max enumerator value of COMPARE7 field.                              */
  #define GRTC_INTEN1_COMPARE7_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE7_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE8 @Bit 8 : Enable or disable interrupt for event COMPARE[8] */
  #define GRTC_INTEN1_COMPARE8_Pos (8UL)             /*!< Position of COMPARE8 field.                                          */
  #define GRTC_INTEN1_COMPARE8_Msk (0x1UL << GRTC_INTEN1_COMPARE8_Pos) /*!< Bit mask of COMPARE8 field.                        */
  #define GRTC_INTEN1_COMPARE8_Min (0x0UL)           /*!< Min enumerator value of COMPARE8 field.                              */
  #define GRTC_INTEN1_COMPARE8_Max (0x1UL)           /*!< Max enumerator value of COMPARE8 field.                              */
  #define GRTC_INTEN1_COMPARE8_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE8_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE9 @Bit 9 : Enable or disable interrupt for event COMPARE[9] */
  #define GRTC_INTEN1_COMPARE9_Pos (9UL)             /*!< Position of COMPARE9 field.                                          */
  #define GRTC_INTEN1_COMPARE9_Msk (0x1UL << GRTC_INTEN1_COMPARE9_Pos) /*!< Bit mask of COMPARE9 field.                        */
  #define GRTC_INTEN1_COMPARE9_Min (0x0UL)           /*!< Min enumerator value of COMPARE9 field.                              */
  #define GRTC_INTEN1_COMPARE9_Max (0x1UL)           /*!< Max enumerator value of COMPARE9 field.                              */
  #define GRTC_INTEN1_COMPARE9_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE9_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE10 @Bit 10 : Enable or disable interrupt for event COMPARE[10] */
  #define GRTC_INTEN1_COMPARE10_Pos (10UL)           /*!< Position of COMPARE10 field.                                         */
  #define GRTC_INTEN1_COMPARE10_Msk (0x1UL << GRTC_INTEN1_COMPARE10_Pos) /*!< Bit mask of COMPARE10 field.                     */
  #define GRTC_INTEN1_COMPARE10_Min (0x0UL)          /*!< Min enumerator value of COMPARE10 field.                             */
  #define GRTC_INTEN1_COMPARE10_Max (0x1UL)          /*!< Max enumerator value of COMPARE10 field.                             */
  #define GRTC_INTEN1_COMPARE10_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE10_Enabled (0x1UL)      /*!< Enable                                                               */

/* COMPARE11 @Bit 11 : Enable or disable interrupt for event COMPARE[11] */
  #define GRTC_INTEN1_COMPARE11_Pos (11UL)           /*!< Position of COMPARE11 field.                                         */
  #define GRTC_INTEN1_COMPARE11_Msk (0x1UL << GRTC_INTEN1_COMPARE11_Pos) /*!< Bit mask of COMPARE11 field.                     */
  #define GRTC_INTEN1_COMPARE11_Min (0x0UL)          /*!< Min enumerator value of COMPARE11 field.                             */
  #define GRTC_INTEN1_COMPARE11_Max (0x1UL)          /*!< Max enumerator value of COMPARE11 field.                             */
  #define GRTC_INTEN1_COMPARE11_Disabled (0x0UL)     /*!< Disable                                                              */
  #define GRTC_INTEN1_COMPARE11_Enabled (0x1UL)      /*!< Enable                                                               */

/* RTCOMPARESYNC @Bit 25 : Enable or disable interrupt for event RTCOMPARESYNC */
  #define GRTC_INTEN1_RTCOMPARESYNC_Pos (25UL)       /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTEN1_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTEN1_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field.         */
  #define GRTC_INTEN1_RTCOMPARESYNC_Min (0x0UL)      /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTEN1_RTCOMPARESYNC_Max (0x1UL)      /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTEN1_RTCOMPARESYNC_Disabled (0x0UL) /*!< Disable                                                              */
  #define GRTC_INTEN1_RTCOMPARESYNC_Enabled (0x1UL)  /*!< Enable                                                               */

