NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* PDM_FILTER_HPPOLE: Settings for the high-pass filter */
  #define PDM_FILTER_HPPOLE_ResetValue (0x00000005UL) /*!< Reset value of HPPOLE register.                                     */

/* HPPOLE @Bits 0..3 : Settings for the high-pass filter -3dB gain pole, assuming filter source clock of 16KHz */
  #define PDM_FILTER_HPPOLE_HPPOLE_Pos (0UL)         /*!< Position of HPPOLE field.                                            */
  #define PDM_FILTER_HPPOLE_HPPOLE_Msk (0xFUL << PDM_FILTER_HPPOLE_HPPOLE_Pos) /*!< Bit mask of HPPOLE field.                  */
  #define PDM_FILTER_HPPOLE_HPPOLE_Min (0x1UL)       /*!< Min enumerator value of HPPOLE field.                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_Max (0xFUL)       /*!< Max enumerator value of HPPOLE field.                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p0p16 (0xFUL)     /*!< 0.16 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p0p32 (0xEUL)     /*!< 0.32 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p0p64 (0xDUL)     /*!< 0.64 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p1p25 (0xCUL)     /*!< 1.25 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p2p5 (0xBUL)      /*!< 2.5 Hz                                                               */
  #define PDM_FILTER_HPPOLE_HPPOLE_p5 (0xAUL)        /*!< 5 Hz                                                                 */
  #define PDM_FILTER_HPPOLE_HPPOLE_p10 (0x9UL)       /*!< 10 Hz                                                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p20 (0x8UL)       /*!< 20 Hz                                                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p40 (0x7UL)       /*!< 40 Hz                                                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p79 (0x6UL)       /*!< 79 Hz                                                                */
  #define PDM_FILTER_HPPOLE_HPPOLE_p157 (0x5UL)      /*!< 157 Hz                                                               */
  #define PDM_FILTER_HPPOLE_HPPOLE_p310 (0x4UL)      /*!< 310 Hz                                                               */
  #define PDM_FILTER_HPPOLE_HPPOLE_p603 (0x3UL)      /*!< 603 Hz                                                               */
  #define PDM_FILTER_HPPOLE_HPPOLE_p1152 (0x2UL)     /*!< 1152 Hz                                                              */
  #define PDM_FILTER_HPPOLE_HPPOLE_p2110 (0x1UL)     /*!< 2110 Hz                                                              */


/* PDM_FILTER_HPDISABLE: High pass filter disable */
  #define PDM_FILTER_HPDISABLE_ResetValue (0x00000001UL) /*!< Reset value of HPDISABLE register.                               */

/* DISABLE @Bit 0 : High pass filter disable */
  #define PDM_FILTER_HPDISABLE_DISABLE_Pos (0UL)     /*!< Position of DISABLE field.                                           */
  #define PDM_FILTER_HPDISABLE_DISABLE_Msk (0x1UL << PDM_FILTER_HPDISABLE_DISABLE_Pos) /*!< Bit mask of DISABLE field.         */
  #define PDM_FILTER_HPDISABLE_DISABLE_Min (0x0UL)   /*!< Min enumerator value of DISABLE field.                               */
  #define PDM_FILTER_HPDISABLE_DISABLE_Max (0x1UL)   /*!< Max enumerator value of DISABLE field.                               */
  #define PDM_FILTER_HPDISABLE_DISABLE_Enable (0x0UL) /*!< High pass filter enabled                                            */
  #define PDM_FILTER_HPDISABLE_DISABLE_Disable (0x1UL) /*!< High pass filter disabled                                          */


/* PDM_FILTER_SOFTMUTE: Soft mute function */
  #define PDM_FILTER_SOFTMUTE_ResetValue (0x00000000UL) /*!< Reset value of SOFTMUTE register.                                 */

/* ENABLE @Bit 0 : Soft mute function */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Pos (0UL)       /*!< Position of ENABLE field.                                            */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Msk (0x1UL << PDM_FILTER_SOFTMUTE_ENABLE_Pos) /*!< Bit mask of ENABLE field.              */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Min (0x0UL)     /*!< Min enumerator value of ENABLE field.                                */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Max (0x1UL)     /*!< Max enumerator value of ENABLE field.                                */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Disabled (0x0UL) /*!< Disable soft mute function                                          */
  #define PDM_FILTER_SOFTMUTE_ENABLE_Enabled (0x1UL) /*!< Enable soft mute function                                            */


/* PDM_FILTER_SOFTCYCLES: Soft mute settings */
  #define PDM_FILTER_SOFTCYCLES_ResetValue (0x00000002UL) /*!< Reset value of SOFTCYCLES register.                             */

/* DISABLE @Bits 0..2 : Soft mute settings: amount of cycles for transition */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_Pos (0UL)    /*!< Position of DISABLE field.                                           */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_Msk (0x7UL << PDM_FILTER_SOFTCYCLES_DISABLE_Pos) /*!< Bit mask of DISABLE field.       */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_Min (0x0UL)  /*!< Min enumerator value of DISABLE field.                               */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_Max (0x7UL)  /*!< Max enumerator value of DISABLE field.                               */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s2 (0x0UL)   /*!< 2 filter source clock cycles                                         */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s8 (0x1UL)   /*!< 8 filter source clock cycles                                         */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s32 (0x2UL)  /*!< 32 filter source clock cycles                                        */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s64 (0x3UL)  /*!< 64 filter source clock cycles                                        */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s128 (0x4UL) /*!< 128 filter source clock cycles                                       */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s256 (0x5UL) /*!< 256 filter source clock cycles                                       */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_s512 (0x6UL) /*!< 512 filter source clock cycles                                       */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_Custom (0x7UL) /*!< The number of cycles can be set using FILTER.CTRL[17:14] bits      */
  #define PDM_FILTER_SOFTCYCLES_DISABLE_custom (0x7UL) /*!< See the Custom enumerator                                          */


