NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* QDEC_SAMPLE: Motion sample value */
  #define QDEC_SAMPLE_ResetValue (0x00000000UL)      /*!< Reset value of SAMPLE register.                                      */

/* SAMPLE @Bits 0..31 : Last motion sample */
  #define QDEC_SAMPLE_SAMPLE_Pos (0UL)               /*!< Position of SAMPLE field.                                            */
  #define QDEC_SAMPLE_SAMPLE_Msk (0xFFFFFFFFUL << QDEC_SAMPLE_SAMPLE_Pos) /*!< Bit mask of SAMPLE field.                       */
  #define QDEC_SAMPLE_SAMPLE_Min (0xFFFFFFFFUL)      /*!< Min value of SAMPLE field.                                           */
  #define QDEC_SAMPLE_SAMPLE_Max (0x00000002UL)      /*!< Max size of SAMPLE field.                                            */


/* QDEC_REPORTPER: Number of samples to be taken before REPORTRDY and DBLRDY events can be generated */
  #define QDEC_REPORTPER_ResetValue (0x00000000UL)   /*!< Reset value of REPORTPER register.                                   */

/* REPORTPER @Bits 0..3 : Specifies the number of samples to be accumulated in the ACC register before the REPORTRDY and DBLRDY
                          events can be generated. */

  #define QDEC_REPORTPER_REPORTPER_Pos (0UL)         /*!< Position of REPORTPER field.                                         */
  #define QDEC_REPORTPER_REPORTPER_Msk (0xFUL << QDEC_REPORTPER_REPORTPER_Pos) /*!< Bit mask of REPORTPER field.               */
  #define QDEC_REPORTPER_REPORTPER_Min (0x0UL)       /*!< Min enumerator value of REPORTPER field.                             */
  #define QDEC_REPORTPER_REPORTPER_Max (0x8UL)       /*!< Max enumerator value of REPORTPER field.                             */
  #define QDEC_REPORTPER_REPORTPER_10Smpl (0x0UL)    /*!< 10 samples/report                                                    */
  #define QDEC_REPORTPER_REPORTPER_40Smpl (0x1UL)    /*!< 40 samples/report                                                    */
  #define QDEC_REPORTPER_REPORTPER_80Smpl (0x2UL)    /*!< 80 samples/report                                                    */
  #define QDEC_REPORTPER_REPORTPER_120Smpl (0x3UL)   /*!< 120 samples/report                                                   */
  #define QDEC_REPORTPER_REPORTPER_160Smpl (0x4UL)   /*!< 160 samples/report                                                   */
  #define QDEC_REPORTPER_REPORTPER_200Smpl (0x5UL)   /*!< 200 samples/report                                                   */
  #define QDEC_REPORTPER_REPORTPER_240Smpl (0x6UL)   /*!< 240 samples/report                                                   */
  #define QDEC_REPORTPER_REPORTPER_280Smpl (0x7UL)   /*!< 280 samples/report                                                   */
  #define QDEC_REPORTPER_REPORTPER_1Smpl (0x8UL)     /*!< 1 sample/report                                                      */


/* QDEC_ACC: Register accumulating the valid transitions */
  #define QDEC_ACC_ResetValue (0x00000000UL)         /*!< Reset value of ACC register.                                         */

/* ACC @Bits 0..31 : Register accumulating all valid samples (not double transition) read from the SAMPLE register. */
  #define QDEC_ACC_ACC_Pos (0UL)                     /*!< Position of ACC field.                                               */
  #define QDEC_ACC_ACC_Msk (0xFFFFFFFFUL << QDEC_ACC_ACC_Pos) /*!< Bit mask of ACC field.                                      */
  #define QDEC_ACC_ACC_Min (0xFFFFFC00UL)            /*!< Min value of ACC field.                                              */
  #define QDEC_ACC_ACC_Max (0x000003FFUL)            /*!< Max size of ACC field.                                               */


/* QDEC_ACCREAD: Snapshot of the ACC register, updated by the READCLRACC or RDCLRACC task */
  #define QDEC_ACCREAD_ResetValue (0x00000000UL)     /*!< Reset value of ACCREAD register.                                     */

/* ACCREAD @Bits 0..31 : Snapshot of the ACC register. */
  #define QDEC_ACCREAD_ACCREAD_Pos (0UL)             /*!< Position of ACCREAD field.                                           */
  #define QDEC_ACCREAD_ACCREAD_Msk (0xFFFFFFFFUL << QDEC_ACCREAD_ACCREAD_Pos) /*!< Bit mask of ACCREAD field.                  */
  #define QDEC_ACCREAD_ACCREAD_Min (0xFFFFFC00UL)    /*!< Min value of ACCREAD field.                                          */
  #define QDEC_ACCREAD_ACCREAD_Max (0x000003FFUL)    /*!< Max size of ACCREAD field.                                           */


/* QDEC_DBFEN: Enable input debounce filters */
  #define QDEC_DBFEN_ResetValue (0x00000000UL)       /*!< Reset value of DBFEN register.                                       */

/* DBFEN @Bit 0 : Enable input debounce filters */
  #define QDEC_DBFEN_DBFEN_Pos (0UL)                 /*!< Position of DBFEN field.                                             */
  #define QDEC_DBFEN_DBFEN_Msk (0x1UL << QDEC_DBFEN_DBFEN_Pos) /*!< Bit mask of DBFEN field.                                   */
  #define QDEC_DBFEN_DBFEN_Min (0x0UL)               /*!< Min enumerator value of DBFEN field.                                 */
  #define QDEC_DBFEN_DBFEN_Max (0x1UL)               /*!< Max enumerator value of DBFEN field.                                 */
  #define QDEC_DBFEN_DBFEN_Disabled (0x0UL)          /*!< Debounce input filters disabled                                      */
  #define QDEC_DBFEN_DBFEN_Enabled (0x1UL)           /*!< Debounce input filters enabled                                       */


/* QDEC_LEDPRE: Time period the LED is switched ON prior to sampling */
  #define QDEC_LEDPRE_ResetValue (0x00000010UL)      /*!< Reset value of LEDPRE register.                                      */

/* LEDPRE @Bits 0..8 : Period in us the LED is switched on prior to sampling */
  #define QDEC_LEDPRE_LEDPRE_Pos (0UL)               /*!< Position of LEDPRE field.                                            */
  #define QDEC_LEDPRE_LEDPRE_Msk (0x1FFUL << QDEC_LEDPRE_LEDPRE_Pos) /*!< Bit mask of LEDPRE field.                            */
  #define QDEC_LEDPRE_LEDPRE_Min (0x001UL)           /*!< Min value of LEDPRE field.                                           */
  #define QDEC_LEDPRE_LEDPRE_Max (0x1FFUL)           /*!< Max size of LEDPRE field.                                            */


/* QDEC_ACCDBL: Register accumulating the number of detected double transitions */
  #define QDEC_ACCDBL_ResetValue (0x00000000UL)      /*!< Reset value of ACCDBL register.                                      */

