NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* RADIO_EVENTS_AUXDATADMAEND: AUXDATA DMA end */
  #define RADIO_EVENTS_AUXDATADMAEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_AUXDATADMAEND register.              */

/* EVENTS_AUXDATADMAEND @Bit 0 : AUXDATA DMA end */
  #define RADIO_EVENTS_AUXDATADMAEND_EVENTS_AUXDATADMAEND_Pos (0UL) /*!< Position of EVENTS_AUXDATADMAEND field.               */
  #define RADIO_EVENTS_AUXDATADMAEND_EVENTS_AUXDATADMAEND_Msk (0x1UL << RADIO_EVENTS_AUXDATADMAEND_EVENTS_AUXDATADMAEND_Pos)
                                                                            /*!< Bit mask of EVENTS_AUXDATADMAEND field.*/
  #define RADIO_EVENTS_AUXDATADMAEND_EVENTS_AUXDATADMAEND_Min (0x0UL) /*!< Min enumerator value of EVENTS_AUXDATADMAEND field. */
  #define RADIO_EVENTS_AUXDATADMAEND_EVENTS_AUXDATADMAEND_Max (0x1UL) /*!< Max enumerator value of EVENTS_AUXDATADMAEND field. */
  #define RADIO_EVENTS_AUXDATADMAEND_EVENTS_AUXDATADMAEND_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define RADIO_EVENTS_AUXDATADMAEND_EVENTS_AUXDATADMAEND_Generated (0x1UL) /*!< Event generated                               */


/* RADIO_EVENTS_CSTONESEND: The channel sounding tone processing is complete */
  #define RADIO_EVENTS_CSTONESEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CSTONESEND register.                    */

/* EVENTS_CSTONESEND @Bit 0 : The channel sounding tone processing is complete */
  #define RADIO_EVENTS_CSTONESEND_EVENTS_CSTONESEND_Pos (0UL) /*!< Position of EVENTS_CSTONESEND field.                        */
  #define RADIO_EVENTS_CSTONESEND_EVENTS_CSTONESEND_Msk (0x1UL << RADIO_EVENTS_CSTONESEND_EVENTS_CSTONESEND_Pos) /*!< Bit mask
                                                                            of EVENTS_CSTONESEND field.*/
  #define RADIO_EVENTS_CSTONESEND_EVENTS_CSTONESEND_Min (0x0UL) /*!< Min enumerator value of EVENTS_CSTONESEND field.          */
  #define RADIO_EVENTS_CSTONESEND_EVENTS_CSTONESEND_Max (0x1UL) /*!< Max enumerator value of EVENTS_CSTONESEND field.          */
  #define RADIO_EVENTS_CSTONESEND_EVENTS_CSTONESEND_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define RADIO_EVENTS_CSTONESEND_EVENTS_CSTONESEND_Generated (0x1UL) /*!< Event generated                                     */


/* RADIO_PUBLISH_READY: Publish configuration for event READY */
  #define RADIO_PUBLISH_READY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_READY register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define RADIO_PUBLISH_READY_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_READY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_READY_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define RADIO_PUBLISH_READY_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_READY_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_READY_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_READY_EN_Msk (0x1UL << RADIO_PUBLISH_READY_EN_Pos) /*!< Bit mask of EN field.                          */
  #define RADIO_PUBLISH_READY_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_READY_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_READY_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_READY_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_TXREADY: Publish configuration for event TXREADY */
  #define RADIO_PUBLISH_TXREADY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXREADY register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event TXREADY will publish to */
  #define RADIO_PUBLISH_TXREADY_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_TXREADY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_TXREADY_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RADIO_PUBLISH_TXREADY_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_TXREADY_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_TXREADY_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_TXREADY_EN_Msk (0x1UL << RADIO_PUBLISH_TXREADY_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RADIO_PUBLISH_TXREADY_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_TXREADY_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_TXREADY_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_TXREADY_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_RXREADY: Publish configuration for event RXREADY */
  #define RADIO_PUBLISH_RXREADY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXREADY register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event RXREADY will publish to */
  #define RADIO_PUBLISH_RXREADY_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_RXREADY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_RXREADY_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RADIO_PUBLISH_RXREADY_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_RXREADY_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_RXREADY_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_RXREADY_EN_Msk (0x1UL << RADIO_PUBLISH_RXREADY_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RADIO_PUBLISH_RXREADY_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RXREADY_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RXREADY_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_RXREADY_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_ADDRESS: Publish configuration for event ADDRESS */
  #define RADIO_PUBLISH_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ADDRESS register.                        */

