NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* RRAMC_ECC_ERRORADDR: Address of the first ECC error that could not be corrected */
  #define RRAMC_ECC_ERRORADDR_ResetValue (0x00FFFFFFUL) /*!< Reset value of ERRORADDR register.                                */

/* ADDRESS @Bits 0..31 : ECC error address */
  #define RRAMC_ECC_ERRORADDR_ADDRESS_Pos (0UL)      /*!< Position of ADDRESS field.                                           */
  #define RRAMC_ECC_ERRORADDR_ADDRESS_Msk (0xFFFFFFFFUL << RRAMC_ECC_ERRORADDR_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.    */



/* =================================================== Struct RRAMC_POWER ==================================================== */
/**
  * @brief POWER [RRAMC_POWER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Power configuration                                   */
  __IOM uint32_t  STANDBYCONFIG;                     /*!< (@ 0x00000004) Standby mode configuration                            */
  __IOM uint32_t  LOWPOWERCONFIG;                    /*!< (@ 0x00000008) Low power mode configuration                          */
} NRF_RRAMC_POWER_Type;                              /*!< Size = 12 (0x00C)                                                    */

/* RRAMC_POWER_CONFIG: Power configuration */
  #define RRAMC_POWER_CONFIG_ResetValue (0x00000100UL) /*!< Reset value of CONFIG register.                                    */

/* ACCESSTIMEOUT @Bits 0..15 : Access timeout, in 31.25 ns units, used for going into standby power mode or remain active on
                               wake up */

  #define RRAMC_POWER_CONFIG_ACCESSTIMEOUT_Pos (0UL) /*!< Position of ACCESSTIMEOUT field.                                     */
  #define RRAMC_POWER_CONFIG_ACCESSTIMEOUT_Msk (0xFFFFUL << RRAMC_POWER_CONFIG_ACCESSTIMEOUT_Pos) /*!< Bit mask of ACCESSTIMEOUT
                                                                            field.*/

/* POF @Bit 16 : Power on failure warning handling configuration */
  #define RRAMC_POWER_CONFIG_POF_Pos (16UL)          /*!< Position of POF field.                                               */
  #define RRAMC_POWER_CONFIG_POF_Msk (0x1UL << RRAMC_POWER_CONFIG_POF_Pos) /*!< Bit mask of POF field.                         */
  #define RRAMC_POWER_CONFIG_POF_Min (0x0UL)         /*!< Min enumerator value of POF field.                                   */
  #define RRAMC_POWER_CONFIG_POF_Max (0x1UL)         /*!< Max enumerator value of POF field.                                   */
  #define RRAMC_POWER_CONFIG_POF_Wait (0x0UL)        /*!< Wait until the current RRAM write finishes                           */
  #define RRAMC_POWER_CONFIG_POF_Abort (0x1UL)       /*!< Abort the current RRAM write                                         */


/* RRAMC_POWER_STANDBYCONFIG: Standby mode configuration */
  #define RRAMC_POWER_STANDBYCONFIG_ResetValue (0x00000000UL) /*!< Reset value of STANDBYCONFIG register.                      */

/* MODE @Bits 0..1 : RRAM standby mode */
  #define RRAMC_POWER_STANDBYCONFIG_MODE_Pos (0UL)   /*!< Position of MODE field.                                              */
  #define RRAMC_POWER_STANDBYCONFIG_MODE_Msk (0x3UL << RRAMC_POWER_STANDBYCONFIG_MODE_Pos) /*!< Bit mask of MODE field.        */
  #define RRAMC_POWER_STANDBYCONFIG_MODE_Min (0x0UL) /*!< Min enumerator value of MODE field.                                  */
  #define RRAMC_POWER_STANDBYCONFIG_MODE_Max (0x3UL) /*!< Max enumerator value of MODE field.                                  */
  #define RRAMC_POWER_STANDBYCONFIG_MODE_Normal (0x0UL) /*!< The RRAM automatically goes into idle mode while the RRAM is not
                                                             being accessed*/
  #define RRAMC_POWER_STANDBYCONFIG_MODE_PowerDown (0x2UL) /*!< The RRAM goes into power down mode when the access timeout
                                                                counter is expired*/
  #define RRAMC_POWER_STANDBYCONFIG_MODE_Standby (0x3UL) /*!< The RRAM remains active while the RRAM is not being accessed.    */


/* RRAMC_POWER_LOWPOWERCONFIG: Low power mode configuration */
  #define RRAMC_POWER_LOWPOWERCONFIG_ResetValue (0x00000000UL) /*!< Reset value of LOWPOWERCONFIG register.                    */

/* MODE @Bits 0..1 : RRAM low power mode */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_Pos (0UL)  /*!< Position of MODE field.                                              */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_Msk (0x3UL << RRAMC_POWER_LOWPOWERCONFIG_MODE_Pos) /*!< Bit mask of MODE field.      */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_Min (0x0UL) /*!< Min enumerator value of MODE field.                                 */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_Max (0x1UL) /*!< Max enumerator value of MODE field.                                 */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_PowerOff (0x0UL) /*!< The RRAM is powered Off                                        */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_Standby (0x1UL) /*!< The RRAM automatically goes into standby mode while the RRAM is
                                                               not being accessed*/



/* =================================================== Struct RRAMC_ERASE ==================================================== */
/**
  * @brief ERASE [RRAMC_ERASE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ERASEALL;                          /*!< (@ 0x00000000) Erase RRAM, including UICR All information in SICR,
                                                                         including keys, are also erased*/
} NRF_RRAMC_ERASE_Type;                              /*!< Size = 4 (0x004)                                                     */

/* RRAMC_ERASE_ERASEALL: Erase RRAM, including UICR All information in SICR, including keys, are also erased */
  #define RRAMC_ERASE_ERASEALL_ResetValue (0x00000000UL) /*!< Reset value of ERASEALL register.                                */

/* ERASE @Bit 0 : Erase RRAM */
  #define RRAMC_ERASE_ERASEALL_ERASE_Pos (0UL)       /*!< Position of ERASE field.                                             */
  #define RRAMC_ERASE_ERASEALL_ERASE_Msk (0x1UL << RRAMC_ERASE_ERASEALL_ERASE_Pos) /*!< Bit mask of ERASE field.               */
  #define RRAMC_ERASE_ERASEALL_ERASE_Min (0x0UL)     /*!< Min enumerator value of ERASE field.                                 */
  #define RRAMC_ERASE_ERASEALL_ERASE_Max (0x1UL)     /*!< Max enumerator value of ERASE field.                                 */
  #define RRAMC_ERASE_ERASEALL_ERASE_NoOperation (0x0UL) /*!< No operation                                                     */
  #define RRAMC_ERASE_ERASEALL_ERASE_Erase (0x1UL)   /*!< Start erase of chip                                                  */



/* =================================================== Struct RRAMC_REGION =================================================== */
/**
  * @brief REGION [RRAMC_REGION] RRAMC can apply access privileges to regions of the RRAM. Some regions are dedicated for system
            use and are not available for configuration - refer to the instantiation table for details.

  */
typedef struct {
  __IOM uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Region address                                        */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000004) Region configuration                                  */
} NRF_RRAMC_REGION_Type;                             /*!< Size = 8 (0x008)                                                     */
  #define RRAMC_REGION_MaxCount (6UL)                /*!< Size of REGION[6] array.                                             */
  #define RRAMC_REGION_MaxIndex (5UL)                /*!< Max index of REGION[6] array.                                        */
  #define RRAMC_REGION_MinIndex (0UL)                /*!< Min index of REGION[6] array.                                        */

/* RRAMC_REGION_ADDRESS: Region address */
  #define RRAMC_REGION_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                                 */

