NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* STARTADDR @Bits 0..31 : Start address of the region [n] */
  #define RRAMC_REGION_ADDRESS_STARTADDR_Pos (0UL)   /*!< Position of STARTADDR field.                                         */
  #define RRAMC_REGION_ADDRESS_STARTADDR_Msk (0xFFFFFFFFUL << RRAMC_REGION_ADDRESS_STARTADDR_Pos) /*!< Bit mask of STARTADDR
                                                                            field.*/


/* RRAMC_REGION_CONFIG: Region configuration */
  #define RRAMC_REGION_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                   */

/* READ @Bit 0 : Read access */
  #define RRAMC_REGION_CONFIG_READ_Pos (0UL)         /*!< Position of READ field.                                              */
  #define RRAMC_REGION_CONFIG_READ_Msk (0x1UL << RRAMC_REGION_CONFIG_READ_Pos) /*!< Bit mask of READ field.                    */
  #define RRAMC_REGION_CONFIG_READ_Min (0x0UL)       /*!< Min enumerator value of READ field.                                  */
  #define RRAMC_REGION_CONFIG_READ_Max (0x1UL)       /*!< Max enumerator value of READ field.                                  */
  #define RRAMC_REGION_CONFIG_READ_NotAllowed (0x0UL) /*!< Read access to override region [n] is not allowed                   */
  #define RRAMC_REGION_CONFIG_READ_Allowed (0x1UL)   /*!< Read access to override region [n] is allowed                        */

/* WRITE @Bit 1 : Write access */
  #define RRAMC_REGION_CONFIG_WRITE_Pos (1UL)        /*!< Position of WRITE field.                                             */
  #define RRAMC_REGION_CONFIG_WRITE_Msk (0x1UL << RRAMC_REGION_CONFIG_WRITE_Pos) /*!< Bit mask of WRITE field.                 */
  #define RRAMC_REGION_CONFIG_WRITE_Min (0x0UL)      /*!< Min enumerator value of WRITE field.                                 */
  #define RRAMC_REGION_CONFIG_WRITE_Max (0x1UL)      /*!< Max enumerator value of WRITE field.                                 */
  #define RRAMC_REGION_CONFIG_WRITE_NotAllowed (0x0UL) /*!< Write access to override region [n] is not allowed                 */
  #define RRAMC_REGION_CONFIG_WRITE_Allowed (0x1UL)  /*!< Write access to override region [n] is allowed                       */

/* EXECUTE @Bit 2 : Execute access */
  #define RRAMC_REGION_CONFIG_EXECUTE_Pos (2UL)      /*!< Position of EXECUTE field.                                           */
  #define RRAMC_REGION_CONFIG_EXECUTE_Msk (0x1UL << RRAMC_REGION_CONFIG_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.           */
  #define RRAMC_REGION_CONFIG_EXECUTE_Min (0x0UL)    /*!< Min enumerator value of EXECUTE field.                               */
  #define RRAMC_REGION_CONFIG_EXECUTE_Max (0x1UL)    /*!< Max enumerator value of EXECUTE field.                               */
  #define RRAMC_REGION_CONFIG_EXECUTE_NotAllowed (0x0UL) /*!< Execute access to override region [n] is not allowed             */
  #define RRAMC_REGION_CONFIG_EXECUTE_Allowed (0x1UL) /*!< Execute access to override region [n] is allowed                    */

/* SECURE @Bit 3 : Secure access */
  #define RRAMC_REGION_CONFIG_SECURE_Pos (3UL)       /*!< Position of SECURE field.                                            */
  #define RRAMC_REGION_CONFIG_SECURE_Msk (0x1UL << RRAMC_REGION_CONFIG_SECURE_Pos) /*!< Bit mask of SECURE field.              */
  #define RRAMC_REGION_CONFIG_SECURE_Min (0x0UL)     /*!< Min enumerator value of SECURE field.                                */
  #define RRAMC_REGION_CONFIG_SECURE_Max (0x1UL)     /*!< Max enumerator value of SECURE field.                                */
  #define RRAMC_REGION_CONFIG_SECURE_NonSecure (0x0UL) /*!< Both Secure and non-Secure access to override region [n] is allowed*/
  #define RRAMC_REGION_CONFIG_SECURE_Secure (0x1UL)  /*!< Only secure access to override region [n] is allowed                 */

/* WRITEONCE @Bit 12 : Write-once */
  #define RRAMC_REGION_CONFIG_WRITEONCE_Pos (12UL)   /*!< Position of WRITEONCE field.                                         */
  #define RRAMC_REGION_CONFIG_WRITEONCE_Msk (0x1UL << RRAMC_REGION_CONFIG_WRITEONCE_Pos) /*!< Bit mask of WRITEONCE field.     */
  #define RRAMC_REGION_CONFIG_WRITEONCE_Min (0x0UL)  /*!< Min enumerator value of WRITEONCE field.                             */
  #define RRAMC_REGION_CONFIG_WRITEONCE_Max (0x1UL)  /*!< Max enumerator value of WRITEONCE field.                             */
  #define RRAMC_REGION_CONFIG_WRITEONCE_Disabled (0x0UL) /*!< Write-once disabled                                              */
  #define RRAMC_REGION_CONFIG_WRITEONCE_Enabled (0x1UL) /*!< Write-once enabled                                                */

/* LOCK @Bit 13 : Enable lock */
  #define RRAMC_REGION_CONFIG_LOCK_Pos (13UL)        /*!< Position of LOCK field.                                              */
  #define RRAMC_REGION_CONFIG_LOCK_Msk (0x1UL << RRAMC_REGION_CONFIG_LOCK_Pos) /*!< Bit mask of LOCK field.                    */
  #define RRAMC_REGION_CONFIG_LOCK_Min (0x0UL)       /*!< Min enumerator value of LOCK field.                                  */
  #define RRAMC_REGION_CONFIG_LOCK_Max (0x1UL)       /*!< Max enumerator value of LOCK field.                                  */
  #define RRAMC_REGION_CONFIG_LOCK_Disabled (0x0UL)  /*!< Lock disabled for region [n]                                         */
  #define RRAMC_REGION_CONFIG_LOCK_Enabled (0x1UL)   /*!< Lock enabled for region [n]                                          */

/* SIZE @Bits 16..22 : Size in KBytes of region [n] */
  #define RRAMC_REGION_CONFIG_SIZE_Pos (16UL)        /*!< Position of SIZE field.                                              */
  #define RRAMC_REGION_CONFIG_SIZE_Msk (0x7FUL << RRAMC_REGION_CONFIG_SIZE_Pos) /*!< Bit mask of SIZE field.                   */


/* ====================================================== Struct RRAMC ======================================================= */
/**
  * @brief RRAM controller GLITCH detector
  */
  typedef struct {                                   /*!< RRAMC Structure                                                      */
    __OM uint32_t TASKS_WAKEUP;                      /*!< (@ 0x00000000) Wakeup the RRAM from low power mode                   */
    __OM uint32_t TASKS_CLRWRITEBUF;                 /*!< (@ 0x00000004) Clear internal write-buffer                           */
    __OM uint32_t TASKS_COMMITWRITEBUF;              /*!< (@ 0x00000008) Commits the data stored in internal write-buffer to
                                                                         RRAM*/
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_WAKEUP;                 /*!< (@ 0x00000080) Subscribe configuration for task WAKEUP               */
    __IOM uint32_t SUBSCRIBE_CLRWRITEBUF;            /*!< (@ 0x00000084) Subscribe configuration for task CLRWRITEBUF          */
    __IOM uint32_t SUBSCRIBE_COMMITWRITEBUF;         /*!< (@ 0x00000088) Subscribe configuration for task COMMITWRITEBUF       */
    __IM uint32_t RESERVED1[29];
    __IOM uint32_t EVENTS_WOKENUP;                   /*!< (@ 0x00000100) RRAMC is woken up from low power mode                 */
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000104) RRAMC is ready                                        */
    __IOM uint32_t EVENTS_READYNEXT;                 /*!< (@ 0x00000108) Ready to accept a new write operation                 */
    __IOM uint32_t EVENTS_ACCESSERROR;               /*!< (@ 0x0000010C) RRAM access error                                     */
    __IM uint32_t RESERVED2[28];
    __IOM uint32_t PUBLISH_WOKENUP;                  /*!< (@ 0x00000180) Publish configuration for event WOKENUP               */
    __IM uint32_t RESERVED3[95];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED4[60];
    __IM uint32_t READY;                             /*!< (@ 0x00000400) RRAMC ready status                                    */
    __IM uint32_t READYNEXT;                         /*!< (@ 0x00000404) Ready next flag                                       */
    __IM uint32_t ACCESSERRORADDR;                   /*!< (@ 0x00000408) Address of the first access error                     */
    __IM uint32_t RESERVED5;
    __IOM NRF_RRAMC_BUFSTATUS_Type BUFSTATUS;        /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED6;
    __IOM NRF_RRAMC_ECC_Type ECC;                    /*!< (@ 0x00000420) (unspecified)                                         */
    __IM uint32_t RESERVED7[55];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000500) Configuration register                                */
    __IM uint32_t RESERVED8[2];
    __IOM uint32_t READYNEXTTIMEOUT;                 /*!< (@ 0x0000050C) Configuration for ready next timeout counter, in units
                                                                         of AXI clock frequency*/
    __IOM NRF_RRAMC_POWER_Type POWER;                /*!< (@ 0x00000510) (unspecified)                                         */
    __IM uint32_t RESERVED9[9];
    __IOM NRF_RRAMC_ERASE_Type ERASE;                /*!< (@ 0x00000540) (unspecified)                                         */
    __IM uint32_t RESERVED10[3];
    __IOM NRF_RRAMC_REGION_Type REGION[6];           /*!< (@ 0x00000550) RRAMC can apply access privileges to regions of the
                                                                         RRAM. Some regions are dedicated for system use and are
                                                                         not available for configuration - refer to the
                                                                         instantiation table for details.*/
  } NRF_RRAMC_Type;                                  /*!< Size = 1408 (0x580)                                                  */

/* RRAMC_TASKS_WAKEUP: Wakeup the RRAM from low power mode */
  #define RRAMC_TASKS_WAKEUP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_WAKEUP register.                              */

/* TASKS_WAKEUP @Bit 0 : Wakeup the RRAM from low power mode */
  #define RRAMC_TASKS_WAKEUP_TASKS_WAKEUP_Pos (0UL)  /*!< Position of TASKS_WAKEUP field.                                      */
  #define RRAMC_TASKS_WAKEUP_TASKS_WAKEUP_Msk (0x1UL << RRAMC_TASKS_WAKEUP_TASKS_WAKEUP_Pos) /*!< Bit mask of TASKS_WAKEUP
                                                                            field.*/
  #define RRAMC_TASKS_WAKEUP_TASKS_WAKEUP_Min (0x1UL) /*!< Min enumerator value of TASKS_WAKEUP field.                         */
  #define RRAMC_TASKS_WAKEUP_TASKS_WAKEUP_Max (0x1UL) /*!< Max enumerator value of TASKS_WAKEUP field.                         */
  #define RRAMC_TASKS_WAKEUP_TASKS_WAKEUP_Trigger (0x1UL) /*!< Trigger task                                                    */


/* RRAMC_TASKS_CLRWRITEBUF: Clear internal write-buffer */
  #define RRAMC_TASKS_CLRWRITEBUF_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CLRWRITEBUF register.                    */

/* TASKS_CLRWRITEBUF @Bit 0 : Clear internal write-buffer */
  #define RRAMC_TASKS_CLRWRITEBUF_TASKS_CLRWRITEBUF_Pos (0UL) /*!< Position of TASKS_CLRWRITEBUF field.                        */
  #define RRAMC_TASKS_CLRWRITEBUF_TASKS_CLRWRITEBUF_Msk (0x1UL << RRAMC_TASKS_CLRWRITEBUF_TASKS_CLRWRITEBUF_Pos) /*!< Bit mask
                                                                            of TASKS_CLRWRITEBUF field.*/
  #define RRAMC_TASKS_CLRWRITEBUF_TASKS_CLRWRITEBUF_Min (0x1UL) /*!< Min enumerator value of TASKS_CLRWRITEBUF field.          */
  #define RRAMC_TASKS_CLRWRITEBUF_TASKS_CLRWRITEBUF_Max (0x1UL) /*!< Max enumerator value of TASKS_CLRWRITEBUF field.          */
  #define RRAMC_TASKS_CLRWRITEBUF_TASKS_CLRWRITEBUF_Trigger (0x1UL) /*!< Trigger task                                          */


