NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* TAMPC_EVENTS_TAMPER: Tamper controller detected an error. */
  #define TAMPC_EVENTS_TAMPER_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TAMPER register.                            */

/* EVENTS_TAMPER @Bit 0 : Tamper controller detected an error. */
  #define TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Pos (0UL) /*!< Position of EVENTS_TAMPER field.                                    */
  #define TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Msk (0x1UL << TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Pos) /*!< Bit mask of EVENTS_TAMPER
                                                                            field.*/
  #define TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Min (0x0UL) /*!< Min enumerator value of EVENTS_TAMPER field.                      */
  #define TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Max (0x1UL) /*!< Max enumerator value of EVENTS_TAMPER field.                      */
  #define TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Generated (0x1UL) /*!< Event generated                                             */


/* TAMPC_EVENTS_WRITEERROR: Attempt to write a VALUE in PROTECT registers without clearing the WRITEPROTECT. */
  #define TAMPC_EVENTS_WRITEERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_WRITEERROR register.                    */

/* EVENTS_WRITEERROR @Bit 0 : Attempt to write a VALUE in PROTECT registers without clearing the WRITEPROTECT. */
  #define TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Pos (0UL) /*!< Position of EVENTS_WRITEERROR field.                        */
  #define TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Msk (0x1UL << TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Pos) /*!< Bit mask
                                                                            of EVENTS_WRITEERROR field.*/
  #define TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_WRITEERROR field.          */
  #define TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_WRITEERROR field.          */
  #define TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Generated (0x1UL) /*!< Event generated                                     */


/* TAMPC_INTEN: Enable or disable interrupt */
  #define TAMPC_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* TAMPER @Bit 0 : Enable or disable interrupt for event TAMPER */
  #define TAMPC_INTEN_TAMPER_Pos (0UL)               /*!< Position of TAMPER field.                                            */
  #define TAMPC_INTEN_TAMPER_Msk (0x1UL << TAMPC_INTEN_TAMPER_Pos) /*!< Bit mask of TAMPER field.                              */
  #define TAMPC_INTEN_TAMPER_Min (0x0UL)             /*!< Min enumerator value of TAMPER field.                                */
  #define TAMPC_INTEN_TAMPER_Max (0x1UL)             /*!< Max enumerator value of TAMPER field.                                */
  #define TAMPC_INTEN_TAMPER_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TAMPC_INTEN_TAMPER_Enabled (0x1UL)         /*!< Enable                                                               */

/* WRITEERROR @Bit 1 : Enable or disable interrupt for event WRITEERROR */
  #define TAMPC_INTEN_WRITEERROR_Pos (1UL)           /*!< Position of WRITEERROR field.                                        */
  #define TAMPC_INTEN_WRITEERROR_Msk (0x1UL << TAMPC_INTEN_WRITEERROR_Pos) /*!< Bit mask of WRITEERROR field.                  */
  #define TAMPC_INTEN_WRITEERROR_Min (0x0UL)         /*!< Min enumerator value of WRITEERROR field.                            */
  #define TAMPC_INTEN_WRITEERROR_Max (0x1UL)         /*!< Max enumerator value of WRITEERROR field.                            */
  #define TAMPC_INTEN_WRITEERROR_Disabled (0x0UL)    /*!< Disable                                                              */
  #define TAMPC_INTEN_WRITEERROR_Enabled (0x1UL)     /*!< Enable                                                               */


/* TAMPC_INTENSET: Enable interrupt */
  #define TAMPC_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* TAMPER @Bit 0 : Write '1' to enable interrupt for event TAMPER */
  #define TAMPC_INTENSET_TAMPER_Pos (0UL)            /*!< Position of TAMPER field.                                            */
  #define TAMPC_INTENSET_TAMPER_Msk (0x1UL << TAMPC_INTENSET_TAMPER_Pos) /*!< Bit mask of TAMPER field.                        */
  #define TAMPC_INTENSET_TAMPER_Min (0x0UL)          /*!< Min enumerator value of TAMPER field.                                */
  #define TAMPC_INTENSET_TAMPER_Max (0x1UL)          /*!< Max enumerator value of TAMPER field.                                */
  #define TAMPC_INTENSET_TAMPER_Set (0x1UL)          /*!< Enable                                                               */
  #define TAMPC_INTENSET_TAMPER_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TAMPC_INTENSET_TAMPER_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* WRITEERROR @Bit 1 : Write '1' to enable interrupt for event WRITEERROR */
  #define TAMPC_INTENSET_WRITEERROR_Pos (1UL)        /*!< Position of WRITEERROR field.                                        */
  #define TAMPC_INTENSET_WRITEERROR_Msk (0x1UL << TAMPC_INTENSET_WRITEERROR_Pos) /*!< Bit mask of WRITEERROR field.            */
  #define TAMPC_INTENSET_WRITEERROR_Min (0x0UL)      /*!< Min enumerator value of WRITEERROR field.                            */
  #define TAMPC_INTENSET_WRITEERROR_Max (0x1UL)      /*!< Max enumerator value of WRITEERROR field.                            */
  #define TAMPC_INTENSET_WRITEERROR_Set (0x1UL)      /*!< Enable                                                               */
  #define TAMPC_INTENSET_WRITEERROR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define TAMPC_INTENSET_WRITEERROR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* TAMPC_INTENCLR: Disable interrupt */
  #define TAMPC_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* TAMPER @Bit 0 : Write '1' to disable interrupt for event TAMPER */
  #define TAMPC_INTENCLR_TAMPER_Pos (0UL)            /*!< Position of TAMPER field.                                            */
  #define TAMPC_INTENCLR_TAMPER_Msk (0x1UL << TAMPC_INTENCLR_TAMPER_Pos) /*!< Bit mask of TAMPER field.                        */
  #define TAMPC_INTENCLR_TAMPER_Min (0x0UL)          /*!< Min enumerator value of TAMPER field.                                */
  #define TAMPC_INTENCLR_TAMPER_Max (0x1UL)          /*!< Max enumerator value of TAMPER field.                                */
  #define TAMPC_INTENCLR_TAMPER_Clear (0x1UL)        /*!< Disable                                                              */
  #define TAMPC_INTENCLR_TAMPER_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TAMPC_INTENCLR_TAMPER_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

