NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event RXPTRUPD will publish to */
  #define TDM_PUBLISH_RXPTRUPD_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_RXPTRUPD_CHIDX_Msk (0xFFUL << TDM_PUBLISH_RXPTRUPD_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TDM_PUBLISH_RXPTRUPD_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_RXPTRUPD_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_RXPTRUPD_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_RXPTRUPD_EN_Msk (0x1UL << TDM_PUBLISH_RXPTRUPD_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TDM_PUBLISH_RXPTRUPD_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_RXPTRUPD_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_RXPTRUPD_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_RXPTRUPD_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* TDM_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define TDM_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define TDM_PUBLISH_STOPPED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << TDM_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TDM_PUBLISH_STOPPED_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_STOPPED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_STOPPED_EN_Msk (0x1UL << TDM_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TDM_PUBLISH_STOPPED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_STOPPED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_STOPPED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_STOPPED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* TDM_PUBLISH_ABORTED: Publish configuration for event ABORTED */
  #define TDM_PUBLISH_ABORTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ABORTED register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event ABORTED will publish to */
  #define TDM_PUBLISH_ABORTED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_ABORTED_CHIDX_Msk (0xFFUL << TDM_PUBLISH_ABORTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TDM_PUBLISH_ABORTED_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_ABORTED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_ABORTED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_ABORTED_EN_Msk (0x1UL << TDM_PUBLISH_ABORTED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TDM_PUBLISH_ABORTED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_ABORTED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_ABORTED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_ABORTED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* TDM_PUBLISH_TXPTRUPD: Publish configuration for event TXPTRUPD */
  #define TDM_PUBLISH_TXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXPTRUPD register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event TXPTRUPD will publish to */
  #define TDM_PUBLISH_TXPTRUPD_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_TXPTRUPD_CHIDX_Msk (0xFFUL << TDM_PUBLISH_TXPTRUPD_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TDM_PUBLISH_TXPTRUPD_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_TXPTRUPD_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_TXPTRUPD_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_TXPTRUPD_EN_Msk (0x1UL << TDM_PUBLISH_TXPTRUPD_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TDM_PUBLISH_TXPTRUPD_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_TXPTRUPD_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_TXPTRUPD_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_TXPTRUPD_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


