NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* TEMP_INTENSET: Enable interrupt */
  #define TEMP_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* DATARDY @Bit 0 : Write '1' to enable interrupt for event DATARDY */
  #define TEMP_INTENSET_DATARDY_Pos (0UL)            /*!< Position of DATARDY field.                                           */
  #define TEMP_INTENSET_DATARDY_Msk (0x1UL << TEMP_INTENSET_DATARDY_Pos) /*!< Bit mask of DATARDY field.                       */
  #define TEMP_INTENSET_DATARDY_Min (0x0UL)          /*!< Min enumerator value of DATARDY field.                               */
  #define TEMP_INTENSET_DATARDY_Max (0x1UL)          /*!< Max enumerator value of DATARDY field.                               */
  #define TEMP_INTENSET_DATARDY_Set (0x1UL)          /*!< Enable                                                               */
  #define TEMP_INTENSET_DATARDY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TEMP_INTENSET_DATARDY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* TEMP_INTENCLR: Disable interrupt */
  #define TEMP_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* DATARDY @Bit 0 : Write '1' to disable interrupt for event DATARDY */
  #define TEMP_INTENCLR_DATARDY_Pos (0UL)            /*!< Position of DATARDY field.                                           */
  #define TEMP_INTENCLR_DATARDY_Msk (0x1UL << TEMP_INTENCLR_DATARDY_Pos) /*!< Bit mask of DATARDY field.                       */
  #define TEMP_INTENCLR_DATARDY_Min (0x0UL)          /*!< Min enumerator value of DATARDY field.                               */
  #define TEMP_INTENCLR_DATARDY_Max (0x1UL)          /*!< Max enumerator value of DATARDY field.                               */
  #define TEMP_INTENCLR_DATARDY_Clear (0x1UL)        /*!< Disable                                                              */
  #define TEMP_INTENCLR_DATARDY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TEMP_INTENCLR_DATARDY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* TEMP_TEMP: Temperature in degC (0.25deg steps) */
  #define TEMP_TEMP_ResetValue (0x00000000UL)        /*!< Reset value of TEMP register.                                        */

/* TEMP @Bits 0..31 : Temperature in degC (0.25deg steps) */
  #define TEMP_TEMP_TEMP_Pos (0UL)                   /*!< Position of TEMP field.                                              */
  #define TEMP_TEMP_TEMP_Msk (0xFFFFFFFFUL << TEMP_TEMP_TEMP_Pos) /*!< Bit mask of TEMP field.                                 */


/* TEMP_A0: Slope of 1st piece wise linear function */
  #define TEMP_A0_ResetValue (0x0000038CUL)          /*!< Reset value of A0 register.                                          */

/* A0 @Bits 0..11 : Slope of 1st piece wise linear function */
  #define TEMP_A0_A0_Pos (0UL)                       /*!< Position of A0 field.                                                */
  #define TEMP_A0_A0_Msk (0xFFFUL << TEMP_A0_A0_Pos) /*!< Bit mask of A0 field.                                                */


/* TEMP_A1: Slope of 2nd piece wise linear function */
  #define TEMP_A1_ResetValue (0x000003B3UL)          /*!< Reset value of A1 register.                                          */

/* A1 @Bits 0..11 : Slope of 2nd piece wise linear function */
  #define TEMP_A1_A1_Pos (0UL)                       /*!< Position of A1 field.                                                */
  #define TEMP_A1_A1_Msk (0xFFFUL << TEMP_A1_A1_Pos) /*!< Bit mask of A1 field.                                                */


/* TEMP_A2: Slope of 3rd piece wise linear function */
  #define TEMP_A2_ResetValue (0x000003FAUL)          /*!< Reset value of A2 register.                                          */

/* A2 @Bits 0..11 : Slope of 3rd piece wise linear function */
  #define TEMP_A2_A2_Pos (0UL)                       /*!< Position of A2 field.                                                */
  #define TEMP_A2_A2_Msk (0xFFFUL << TEMP_A2_A2_Pos) /*!< Bit mask of A2 field.                                                */


/* TEMP_A3: Slope of 4th piece wise linear function */
  #define TEMP_A3_ResetValue (0x00000451UL)          /*!< Reset value of A3 register.                                          */

/* A3 @Bits 0..11 : Slope of 4th piece wise linear function */
  #define TEMP_A3_A3_Pos (0UL)                       /*!< Position of A3 field.                                                */
  #define TEMP_A3_A3_Msk (0xFFFUL << TEMP_A3_A3_Pos) /*!< Bit mask of A3 field.                                                */


/* TEMP_A4: Slope of 5th piece wise linear function */
  #define TEMP_A4_ResetValue (0x000004AAUL)          /*!< Reset value of A4 register.                                          */

/* A4 @Bits 0..11 : Slope of 5th piece wise linear function */
  #define TEMP_A4_A4_Pos (0UL)                       /*!< Position of A4 field.                                                */
  #define TEMP_A4_A4_Msk (0xFFFUL << TEMP_A4_A4_Pos) /*!< Bit mask of A4 field.                                                */


/* TEMP_A5: Slope of 6th piece wise linear function */
  #define TEMP_A5_ResetValue (0x00000539UL)          /*!< Reset value of A5 register.                                          */

/* A5 @Bits 0..11 : Slope of 6th piece wise linear function */
  #define TEMP_A5_A5_Pos (0UL)                       /*!< Position of A5 field.                                                */
  #define TEMP_A5_A5_Msk (0xFFFUL << TEMP_A5_A5_Pos) /*!< Bit mask of A5 field.                                                */


/* TEMP_A6: Slope of 7th piece wise linear function */
  #define TEMP_A6_ResetValue (0x00000578UL)          /*!< Reset value of A6 register.                                          */

/* A6 @Bits 0..11 : Slope of 7th piece wise linear function */
  #define TEMP_A6_A6_Pos (0UL)                       /*!< Position of A6 field.                                                */
  #define TEMP_A6_A6_Msk (0xFFFUL << TEMP_A6_A6_Pos) /*!< Bit mask of A6 field.                                                */


/* TEMP_B0: y-intercept of 1st piece wise linear function */
  #define TEMP_B0_ResetValue (0x00000037UL)          /*!< Reset value of B0 register.                                          */

/* B0 @Bits 0..11 : y-intercept of 1st piece wise linear function */
  #define TEMP_B0_B0_Pos (0UL)                       /*!< Position of B0 field.                                                */
  #define TEMP_B0_B0_Msk (0xFFFUL << TEMP_B0_B0_Pos) /*!< Bit mask of B0 field.                                                */


/* TEMP_B1: y-intercept of 2nd piece wise linear function */
  #define TEMP_B1_ResetValue (0x00000011UL)          /*!< Reset value of B1 register.                                          */

/* B1 @Bits 0..11 : y-intercept of 2nd piece wise linear function */
  #define TEMP_B1_B1_Pos (0UL)                       /*!< Position of B1 field.                                                */
  #define TEMP_B1_B1_Msk (0xFFFUL << TEMP_B1_B1_Pos) /*!< Bit mask of B1 field.                                                */


/* TEMP_B2: y-intercept of 3rd piece wise linear function */
  #define TEMP_B2_ResetValue (0x00000005UL)          /*!< Reset value of B2 register.                                          */

/* B2 @Bits 0..11 : y-intercept of 3rd piece wise linear function */
  #define TEMP_B2_B2_Pos (0UL)                       /*!< Position of B2 field.                                                */
  #define TEMP_B2_B2_Msk (0xFFFUL << TEMP_B2_B2_Pos) /*!< Bit mask of B2 field.                                                */


/* TEMP_B3: y-intercept of 4th piece wise linear function */
  #define TEMP_B3_ResetValue (0x0000002BUL)          /*!< Reset value of B3 register.                                          */

/* B3 @Bits 0..11 : y-intercept of 4th piece wise linear function */
  #define TEMP_B3_B3_Pos (0UL)                       /*!< Position of B3 field.                                                */
  #define TEMP_B3_B3_Msk (0xFFFUL << TEMP_B3_B3_Pos) /*!< Bit mask of B3 field.                                                */


/* TEMP_B4: y-intercept of 5th piece wise linear function */
  #define TEMP_B4_ResetValue (0x0000008FUL)          /*!< Reset value of B4 register.                                          */

