NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* TERMSELDLPULSE @Bit 22 : Mode: Device only. TermSel DLine Pulsing Selection (TermSelDLPulse) */
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_Pos (22UL) /*!< Position of TERMSELDLPULSE field.                                   */
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_Msk (0x1UL << USBHSCORE_GUSBCFG_TERMSELDLPULSE_Pos) /*!< Bit mask of TERMSELDLPULSE
                                                                            field.*/
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_Min (0x0UL) /*!< Min enumerator value of TERMSELDLPULSE field.                      */
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_Max (0x1UL) /*!< Max enumerator value of TERMSELDLPULSE field.                      */
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_TXVALID (0x0UL) /*!< Data line pulsing using utmi_txvalid                           */
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_TERMSEL (0x1UL) /*!< Data line pulsing using utmi_termsel                           */

/* ICUSBCAP @Bit 26 : Mode: Host and Device. IC_USB-Capable (IC_USBCap) */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_Pos (26UL)      /*!< Position of ICUSBCAP field.                                          */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_Msk (0x1UL << USBHSCORE_GUSBCFG_ICUSBCAP_Pos) /*!< Bit mask of ICUSBCAP field.            */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_Min (0x0UL)     /*!< Min enumerator value of ICUSBCAP field.                              */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_Max (0x1UL)     /*!< Max enumerator value of ICUSBCAP field.                              */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_NOTSELECTED (0x0UL) /*!< IC_USB PHY Interface is not selected                             */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_SELECTED (0x1UL) /*!< IC_USB PHY Interface is selected                                    */

/* TXENDDELAY @Bit 28 : Mode: Device only. Tx End Delay (TxEndDelay) */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_Pos (28UL)    /*!< Position of TXENDDELAY field.                                        */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_Msk (0x1UL << USBHSCORE_GUSBCFG_TXENDDELAY_Pos) /*!< Bit mask of TXENDDELAY field.      */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_Min (0x0UL)   /*!< Min enumerator value of TXENDDELAY field.                            */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_Max (0x1UL)   /*!< Max enumerator value of TXENDDELAY field.                            */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_DISABLED (0x0UL) /*!< Normal Mode                                                       */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_ENABLED (0x1UL) /*!< Tx End delay                                                       */

/* FORCEHSTMODE @Bit 29 : Mode: Host and device. Force Host Mode (ForceHstMode) */
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_Pos (29UL)  /*!< Position of FORCEHSTMODE field.                                      */
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_Msk (0x1UL << USBHSCORE_GUSBCFG_FORCEHSTMODE_Pos) /*!< Bit mask of FORCEHSTMODE field.*/
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_Min (0x0UL) /*!< Min enumerator value of FORCEHSTMODE field.                          */
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_Max (0x1UL) /*!< Max enumerator value of FORCEHSTMODE field.                          */
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_DISABLED (0x0UL) /*!< Normal Mode                                                     */
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_ENABLED (0x1UL) /*!< Force Host Mode                                                  */

/* FORCEDEVMODE @Bit 30 : Mode:Host and device. Force Device Mode (ForceDevMode) */
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_Pos (30UL)  /*!< Position of FORCEDEVMODE field.                                      */
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_Msk (0x1UL << USBHSCORE_GUSBCFG_FORCEDEVMODE_Pos) /*!< Bit mask of FORCEDEVMODE field.*/
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_Min (0x0UL) /*!< Min enumerator value of FORCEDEVMODE field.                          */
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_Max (0x1UL) /*!< Max enumerator value of FORCEDEVMODE field.                          */
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_DISABLED (0x0UL) /*!< Normal Mode                                                     */
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_ENABLED (0x1UL) /*!< Force Device Mode                                                */

/* CORRUPTTXPKT @Bit 31 : Mode: Host and device. Corrupt Tx packet (CorruptTxPkt) */
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Pos (31UL)  /*!< Position of CORRUPTTXPKT field.                                      */
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Msk (0x1UL << USBHSCORE_GUSBCFG_CORRUPTTXPKT_Pos) /*!< Bit mask of CORRUPTTXPKT field.*/
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Min (0x0UL) /*!< Min enumerator value of CORRUPTTXPKT field.                          */
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Max (0x1UL) /*!< Max enumerator value of CORRUPTTXPKT field.                          */
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Disabled (0x0UL) /*!< Normal Mode                                                     */
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Enabled (0x1UL) /*!< Debug Mode                                                       */


/* USBHSCORE_GRSTCTL: Reset Register */
  #define USBHSCORE_GRSTCTL_ResetValue (0x80000000UL) /*!< Reset value of GRSTCTL register.                                    */

/* CSFTRST @Bit 0 : Mode: Host and Device. Core Soft Reset (CSftRst) */
  #define USBHSCORE_GRSTCTL_CSFTRST_Pos (0UL)        /*!< Position of CSFTRST field.                                           */
  #define USBHSCORE_GRSTCTL_CSFTRST_Msk (0x1UL << USBHSCORE_GRSTCTL_CSFTRST_Pos) /*!< Bit mask of CSFTRST field.               */
  #define USBHSCORE_GRSTCTL_CSFTRST_Min (0x0UL)      /*!< Min enumerator value of CSFTRST field.                               */
  #define USBHSCORE_GRSTCTL_CSFTRST_Max (0x1UL)      /*!< Max enumerator value of CSFTRST field.                               */
  #define USBHSCORE_GRSTCTL_CSFTRST_NOTACTIVE (0x0UL) /*!< No reset                                                            */
  #define USBHSCORE_GRSTCTL_CSFTRST_ACTIVE (0x1UL)   /*!< Resets hclk and phy_clock domains                                    */

/* PIUFSSFTRST @Bit 1 : Mode: Host and Device. PIU FS Dedicated Controller Soft Reset (PIUFSSftRst) */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_Pos (1UL)    /*!< Position of PIUFSSFTRST field.                                       */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_Msk (0x1UL << USBHSCORE_GRSTCTL_PIUFSSFTRST_Pos) /*!< Bit mask of PIUFSSFTRST field.   */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_Min (0x0UL)  /*!< Min enumerator value of PIUFSSFTRST field.                           */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_Max (0x1UL)  /*!< Max enumerator value of PIUFSSFTRST field.                           */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_RESETINACTIVE (0x0UL) /*!< No Reset                                                    */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_RESETACTIVE (0x1UL) /*!< PIU FS Dedicated Controller Soft Reset                        */

