NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* HCHINTMSK @Bit 25 : Mode: Host only. Host Channels Interrupt Mask (HChIntMsk) */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Pos (25UL)     /*!< Position of HCHINTMSK field.                                         */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_HCHINTMSK_Pos) /*!< Bit mask of HCHINTMSK field.         */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Min (0x0UL)    /*!< Min enumerator value of HCHINTMSK field.                             */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Max (0x1UL)    /*!< Max enumerator value of HCHINTMSK field.                             */
  #define USBHSCORE_GINTMSK_HCHINTMSK_MASK (0x0UL)   /*!< Host Channels Interrupt Mask                                         */
  #define USBHSCORE_GINTMSK_HCHINTMSK_NOMASK (0x1UL) /*!< No Host Channels Interrupt Mask                                      */

/* PTXFEMPMSK @Bit 26 : Mode: Host only. Periodic TxFIFO Empty Mask (PTxFEmpMsk) */
  #define USBHSCORE_GINTMSK_PTXFEMPMSK_Pos (26UL)    /*!< Position of PTXFEMPMSK field.                                        */
  #define USBHSCORE_GINTMSK_PTXFEMPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_PTXFEMPMSK_Pos) /*!< Bit mask of PTXFEMPMSK field.      */
  #define USBHSCORE_GINTMSK_PTXFEMPMSK_Min (0x0UL)   /*!< Min enumerator value of PTXFEMPMSK field.                            */
  #define USBHSCORE_GINTMSK_PTXFEMPMSK_Max (0x1UL)   /*!< Max enumerator value of PTXFEMPMSK field.                            */
  #define USBHSCORE_GINTMSK_PTXFEMPMSK_MASK (0x0UL)  /*!< Periodic TxFIFO Empty Mask                                           */
  #define USBHSCORE_GINTMSK_PTXFEMPMSK_NOMASK (0x1UL) /*!< No Periodic TxFIFO Empty Mask                                       */

/* LPMINTMSK @Bit 27 : Mode: Host and Device. LPM Transaction Received Interrupt (LPM_Int) */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Pos (27UL)     /*!< Position of LPMINTMSK field.                                         */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_LPMINTMSK_Pos) /*!< Bit mask of LPMINTMSK field.         */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Min (0x0UL)    /*!< Min enumerator value of LPMINTMSK field.                             */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Max (0x1UL)    /*!< Max enumerator value of LPMINTMSK field.                             */
  #define USBHSCORE_GINTMSK_LPMINTMSK_MASK (0x0UL)   /*!< LPM Transaction received interrupt Mask                              */
  #define USBHSCORE_GINTMSK_LPMINTMSK_NOMASK (0x1UL) /*!< No LPM Transaction received interrupt Mask                           */

/* CONIDSTSCHNGMSK @Bit 28 : Mode: Host and Device. Connector ID Status Change Mask (ConIDStsChngMsk) */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Pos (28UL) /*!< Position of CONIDSTSCHNGMSK field.                                 */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Msk (0x1UL << USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Pos) /*!< Bit mask of
                                                                            CONIDSTSCHNGMSK field.*/
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Min (0x0UL) /*!< Min enumerator value of CONIDSTSCHNGMSK field.                    */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Max (0x1UL) /*!< Max enumerator value of CONIDSTSCHNGMSK field.                    */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_MASK (0x0UL) /*!< Connector ID Status Change Mask                                  */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_NOMASK (0x1UL) /*!< No Connector ID Status Change Mask                             */

/* DISCONNINTMSK @Bit 29 : Mode: Host and Device. Disconnect Detected Interrupt Mask (DisconnIntMsk) */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Pos (29UL) /*!< Position of DISCONNINTMSK field.                                     */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_DISCONNINTMSK_Pos) /*!< Bit mask of DISCONNINTMSK
                                                                            field.*/
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Min (0x0UL) /*!< Min enumerator value of DISCONNINTMSK field.                        */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Max (0x1UL) /*!< Max enumerator value of DISCONNINTMSK field.                        */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_MASK (0x0UL) /*!< Disconnect Detected Interrupt Mask                                 */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_NOMASK (0x1UL) /*!< No Disconnect Detected Interrupt Mask                            */

/* SESSREQINTMSK @Bit 30 : Mode: Host and Device. Session Request/New Session Detected Interrupt Mask (SessReqIntMsk) */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Pos (30UL) /*!< Position of SESSREQINTMSK field.                                     */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_SESSREQINTMSK_Pos) /*!< Bit mask of SESSREQINTMSK
                                                                            field.*/
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Min (0x0UL) /*!< Min enumerator value of SESSREQINTMSK field.                        */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Max (0x1UL) /*!< Max enumerator value of SESSREQINTMSK field.                        */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_MASK (0x0UL) /*!< Session Request or New Session Detected Interrupt Mask             */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_NOMASK (0x1UL) /*!< No Session Request or New Session Detected Interrupt Mask        */

/* WKUPINTMSK @Bit 31 : Mode: Host and Device. Resume/Remote Wakeup Detected Interrupt Mask (WkUpIntMsk) */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Pos (31UL)    /*!< Position of WKUPINTMSK field.                                        */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_WKUPINTMSK_Pos) /*!< Bit mask of WKUPINTMSK field.      */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Min (0x0UL)   /*!< Min enumerator value of WKUPINTMSK field.                            */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Max (0x1UL)   /*!< Max enumerator value of WKUPINTMSK field.                            */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_MASK (0x0UL)  /*!< Resume or Remote Wakeup Detected Interrupt Mask                      */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_NOMASK (0x1UL) /*!< Unmask Resume Remote Wakeup Detected Interrupt                      */


