NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* FSLSSUPP @Bit 2 : FS- and LS-Only Support (FSLSSupp) */
  #define USBHSCORE_HCFG_FSLSSUPP_Pos (2UL)          /*!< Position of FSLSSUPP field.                                          */
  #define USBHSCORE_HCFG_FSLSSUPP_Msk (0x1UL << USBHSCORE_HCFG_FSLSSUPP_Pos) /*!< Bit mask of FSLSSUPP field.                  */
  #define USBHSCORE_HCFG_FSLSSUPP_Min (0x0UL)        /*!< Min enumerator value of FSLSSUPP field.                              */
  #define USBHSCORE_HCFG_FSLSSUPP_Max (0x1UL)        /*!< Max enumerator value of FSLSSUPP field.                              */
  #define USBHSCORE_HCFG_FSLSSUPP_HSFSLS (0x0UL)     /*!< HS/FS/LS, based on the maximum speed supported by the connected
                                                          device*/
  #define USBHSCORE_HCFG_FSLSSUPP_FSLS (0x1UL)       /*!< FS/LS-only, even if the connected device can support HS              */

/* ENA32KHZS @Bit 7 : Enable 32 KHz Suspend mode (Ena32KHzS) */
  #define USBHSCORE_HCFG_ENA32KHZS_Pos (7UL)         /*!< Position of ENA32KHZS field.                                         */
  #define USBHSCORE_HCFG_ENA32KHZS_Msk (0x1UL << USBHSCORE_HCFG_ENA32KHZS_Pos) /*!< Bit mask of ENA32KHZS field.               */
  #define USBHSCORE_HCFG_ENA32KHZS_Min (0x0UL)       /*!< Min enumerator value of ENA32KHZS field.                             */
  #define USBHSCORE_HCFG_ENA32KHZS_Max (0x1UL)       /*!< Max enumerator value of ENA32KHZS field.                             */
  #define USBHSCORE_HCFG_ENA32KHZS_DISABLED (0x0UL)  /*!< 32 KHz Suspend mode disabled                                         */
  #define USBHSCORE_HCFG_ENA32KHZS_ENABLED (0x1UL)   /*!< 32 KHz Suspend mode enabled                                          */

/* RESVALID @Bits 8..15 : Resume Validation Period (ResValid) */
  #define USBHSCORE_HCFG_RESVALID_Pos (8UL)          /*!< Position of RESVALID field.                                          */
  #define USBHSCORE_HCFG_RESVALID_Msk (0xFFUL << USBHSCORE_HCFG_RESVALID_Pos) /*!< Bit mask of RESVALID field.                 */

/* MODECHTIMEN @Bit 31 : Mode Change Ready Timer Enable (ModeChTimEn) */
  #define USBHSCORE_HCFG_MODECHTIMEN_Pos (31UL)      /*!< Position of MODECHTIMEN field.                                       */
  #define USBHSCORE_HCFG_MODECHTIMEN_Msk (0x1UL << USBHSCORE_HCFG_MODECHTIMEN_Pos) /*!< Bit mask of MODECHTIMEN field.         */
  #define USBHSCORE_HCFG_MODECHTIMEN_Min (0x0UL)     /*!< Min enumerator value of MODECHTIMEN field.                           */
  #define USBHSCORE_HCFG_MODECHTIMEN_Max (0x1UL)     /*!< Max enumerator value of MODECHTIMEN field.                           */
  #define USBHSCORE_HCFG_MODECHTIMEN_ENABLED (0x0UL) /*!< The Host core waits for either 200 PHY clock cycles or a linestate of
                                                          SE0 at the end of resume to change the opmode from 0x2 to 0x0*/
  #define USBHSCORE_HCFG_MODECHTIMEN_DISABLED (0x1UL) /*!< The Host core waits only for a linestate of SE0 at the end of resume
                                                           to change the opmode from 0x2 to 0x0*/


/* USBHSCORE_HFIR: Host Frame Interval Register */
  #define USBHSCORE_HFIR_ResetValue (0x0000EA60UL)   /*!< Reset value of HFIR register.                                        */

/* FRINT @Bits 0..15 : Frame Interval (FrInt) */
  #define USBHSCORE_HFIR_FRINT_Pos (0UL)             /*!< Position of FRINT field.                                             */
  #define USBHSCORE_HFIR_FRINT_Msk (0xFFFFUL << USBHSCORE_HFIR_FRINT_Pos) /*!< Bit mask of FRINT field.                        */

/* HFIRRLDCTRL @Bit 16 : Reload Control (HFIRRldCtrl) */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Pos (16UL)      /*!< Position of HFIRRLDCTRL field.                                       */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Msk (0x1UL << USBHSCORE_HFIR_HFIRRLDCTRL_Pos) /*!< Bit mask of HFIRRLDCTRL field.         */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Min (0x0UL)     /*!< Min enumerator value of HFIRRLDCTRL field.                           */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Max (0x1UL)     /*!< Max enumerator value of HFIRRLDCTRL field.                           */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_DISABLED (0x0UL) /*!< The HFIR cannot be reloaded dynamically                             */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_ENABLED (0x1UL) /*!< The HFIR can be dynamically reloaded during runtime                  */


/* USBHSCORE_HFNUM: Host Frame Number/Frame Time Remaining Register */
  #define USBHSCORE_HFNUM_ResetValue (0x00003FFFUL)  /*!< Reset value of HFNUM register.                                       */

/* FRNUM @Bits 0..15 : Frame Number (FrNum) */
  #define USBHSCORE_HFNUM_FRNUM_Pos (0UL)            /*!< Position of FRNUM field.                                             */
  #define USBHSCORE_HFNUM_FRNUM_Msk (0xFFFFUL << USBHSCORE_HFNUM_FRNUM_Pos) /*!< Bit mask of FRNUM field.                      */
  #define USBHSCORE_HFNUM_FRNUM_Min (0x0000UL)       /*!< Min enumerator value of FRNUM field.                                 */
  #define USBHSCORE_HFNUM_FRNUM_Max (0x0001UL)       /*!< Max enumerator value of FRNUM field.                                 */
  #define USBHSCORE_HFNUM_FRNUM_INACTIVE (0x0000UL)  /*!< No SOF is transmitted                                                */
  #define USBHSCORE_HFNUM_FRNUM_ACTIVE (0x0001UL)    /*!< SOF is transmitted                                                   */

/* FRREM @Bits 16..31 : Frame Time Remaining (FrRem) */
  #define USBHSCORE_HFNUM_FRREM_Pos (16UL)           /*!< Position of FRREM field.                                             */
  #define USBHSCORE_HFNUM_FRREM_Msk (0xFFFFUL << USBHSCORE_HFNUM_FRREM_Pos) /*!< Bit mask of FRREM field.                      */


/* USBHSCORE_HPTXSTS: Host Periodic Transmit FIFO/Queue Status Register */
  #define USBHSCORE_HPTXSTS_ResetValue (0x00080C00UL) /*!< Reset value of HPTXSTS register.                                    */

/* PTXFSPCAVAIL @Bits 0..15 : Periodic Transmit Data FIFO Space Available (PTxFSpcAvail) */
  #define USBHSCORE_HPTXSTS_PTXFSPCAVAIL_Pos (0UL)   /*!< Position of PTXFSPCAVAIL field.                                      */
  #define USBHSCORE_HPTXSTS_PTXFSPCAVAIL_Msk (0xFFFFUL << USBHSCORE_HPTXSTS_PTXFSPCAVAIL_Pos) /*!< Bit mask of PTXFSPCAVAIL
                                                                            field.*/

/* PTXQSPCAVAIL @Bits 16..22 : Periodic Transmit Request Queue Space Available (PTxQSpcAvail) */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_Pos (16UL)  /*!< Position of PTXQSPCAVAIL field.                                      */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_Msk (0x7FUL << USBHSCORE_HPTXSTS_PTXQSPCAVAIL_Pos) /*!< Bit mask of PTXQSPCAVAIL
                                                                            field.*/
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_Min (0x00UL) /*!< Min enumerator value of PTXQSPCAVAIL field.                         */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_Max (0x0FUL) /*!< Max enumerator value of PTXQSPCAVAIL field.                         */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FULL (0x00UL) /*!< Periodic Transmit Request Queue is full                            */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE1 (0x01UL) /*!< 1 location available                                              */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE2 (0x02UL) /*!< 2 locations available                                             */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE3 (0x03UL) /*!< 3 locations available                                             */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE4 (0x04UL) /*!< 4 locations available                                             */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE5 (0x05UL) /*!< 5 locations available                                             */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE6 (0x06UL) /*!< 6 locations available                                             */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE7 (0x07UL) /*!< 7 locations available                                             */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE8 (0x08UL) /*!< 8 locations available                                             */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE9 (0x09UL) /*!< 9 locations available                                             */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE10 (0x0AUL) /*!< 10 locations available                                           */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE11 (0x0BUL) /*!< 11 locations available                                           */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE12 (0x0CUL) /*!< 12 locations available                                           */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE13 (0x0DUL) /*!< 13 locations available                                           */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE14 (0x0EUL) /*!< 14 locations available                                           */
  #define USBHSCORE_HPTXSTS_PTXQSPCAVAIL_FREE15 (0x0FUL) /*!< 15 locations available                                           */

/* PTXQTOP @Bits 23..31 : Top of the Periodic Transmit Request Queue (PTxQTop) */
  #define USBHSCORE_HPTXSTS_PTXQTOP_Pos (23UL)       /*!< Position of PTXQTOP field.                                           */
  #define USBHSCORE_HPTXSTS_PTXQTOP_Msk (0x1FFUL << USBHSCORE_HPTXSTS_PTXQTOP_Pos) /*!< Bit mask of PTXQTOP field.             */


/* USBHSCORE_HAINT: Host All Channels Interrupt Register */
  #define USBHSCORE_HAINT_ResetValue (0x00000000UL)  /*!< Reset value of HAINT register.                                       */

/* HAINT @Bits 0..15 : (unspecified) */
  #define USBHSCORE_HAINT_HAINT_Pos (0UL)            /*!< Position of HAINT field.                                             */
  #define USBHSCORE_HAINT_HAINT_Msk (0xFFFFUL << USBHSCORE_HAINT_HAINT_Pos) /*!< Bit mask of HAINT field.                      */
  #define USBHSCORE_HAINT_HAINT_Min (0x0000UL)       /*!< Min enumerator value of HAINT field.                                 */
  #define USBHSCORE_HAINT_HAINT_Max (0x0001UL)       /*!< Max enumerator value of HAINT field.                                 */
  #define USBHSCORE_HAINT_HAINT_INACTIVE (0x0000UL)  /*!< Not active                                                           */
  #define USBHSCORE_HAINT_HAINT_ACTIVE (0x0001UL)    /*!< Host Channel Interrupt                                               */


/* USBHSCORE_HAINTMSK: Host All Channels Interrupt Mask Register */
  #define USBHSCORE_HAINTMSK_ResetValue (0x00000000UL) /*!< Reset value of HAINTMSK register.                                  */

/* HAINTMSK @Bits 0..15 : Channel Interrupt Mask (HAINTMsk) */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Pos (0UL)      /*!< Position of HAINTMSK field.                                          */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Msk (0xFFFFUL << USBHSCORE_HAINTMSK_HAINTMSK_Pos) /*!< Bit mask of HAINTMSK field.       */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Min (0x0000UL) /*!< Min enumerator value of HAINTMSK field.                              */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Max (0x0001UL) /*!< Max enumerator value of HAINTMSK field.                              */
  #define USBHSCORE_HAINTMSK_HAINTMSK_MASK (0x0000UL) /*!< Mask Channel interrupt                                              */
  #define USBHSCORE_HAINTMSK_HAINTMSK_UNMASK (0x0001UL) /*!< UnMask Channel interrupt                                          */


