NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* CGOUTNAK @Bit 10 : Clear Global OUT NAK (CGOUTNak) */
  #define USBHSCORE_DCTL_CGOUTNAK_Pos (10UL)         /*!< Position of CGOUTNAK field.                                          */
  #define USBHSCORE_DCTL_CGOUTNAK_Msk (0x1UL << USBHSCORE_DCTL_CGOUTNAK_Pos) /*!< Bit mask of CGOUTNAK field.                  */
  #define USBHSCORE_DCTL_CGOUTNAK_Min (0x0UL)        /*!< Min enumerator value of CGOUTNAK field.                              */
  #define USBHSCORE_DCTL_CGOUTNAK_Max (0x1UL)        /*!< Max enumerator value of CGOUTNAK field.                              */
  #define USBHSCORE_DCTL_CGOUTNAK_DISABLED (0x0UL)   /*!< Disable Clear Global OUT NAK                                         */
  #define USBHSCORE_DCTL_CGOUTNAK_ENABLED (0x1UL)    /*!< Clear Global OUT NAK                                                 */

/* PWRONPRGDONE @Bit 11 : Power-On Programming Done (PWROnPrgDone) */
  #define USBHSCORE_DCTL_PWRONPRGDONE_Pos (11UL)     /*!< Position of PWRONPRGDONE field.                                      */
  #define USBHSCORE_DCTL_PWRONPRGDONE_Msk (0x1UL << USBHSCORE_DCTL_PWRONPRGDONE_Pos) /*!< Bit mask of PWRONPRGDONE field.      */
  #define USBHSCORE_DCTL_PWRONPRGDONE_Min (0x0UL)    /*!< Min enumerator value of PWRONPRGDONE field.                          */
  #define USBHSCORE_DCTL_PWRONPRGDONE_Max (0x1UL)    /*!< Max enumerator value of PWRONPRGDONE field.                          */
  #define USBHSCORE_DCTL_PWRONPRGDONE_NOTDONE (0x0UL) /*!< Power-On Programming not done                                       */
  #define USBHSCORE_DCTL_PWRONPRGDONE_DONE (0x1UL)   /*!< Power-On Programming Done                                            */

/* IGNRFRMNUM @Bit 15 : Ignore Frame Number Feature for Isochronous Endpoints (IgnrFrmNum) */
  #define USBHSCORE_DCTL_IGNRFRMNUM_Pos (15UL)       /*!< Position of IGNRFRMNUM field.                                        */
  #define USBHSCORE_DCTL_IGNRFRMNUM_Msk (0x1UL << USBHSCORE_DCTL_IGNRFRMNUM_Pos) /*!< Bit mask of IGNRFRMNUM field.            */
  #define USBHSCORE_DCTL_IGNRFRMNUM_Min (0x0UL)      /*!< Min enumerator value of IGNRFRMNUM field.                            */
  #define USBHSCORE_DCTL_IGNRFRMNUM_Max (0x1UL)      /*!< Max enumerator value of IGNRFRMNUM field.                            */
  #define USBHSCORE_DCTL_IGNRFRMNUM_DISABLED (0x0UL) /*!< Scatter/Gather DMA Mode: The core transmits the packets only in the
                                                          frame number in which they are intended to be
                                                          transmitted.Non-Scatter/Gather DMA Mode: Periodic Transfer Interrupt
                                                          feature is disabled.*/
  #define USBHSCORE_DCTL_IGNRFRMNUM_ENABLED (0x1UL)  /*!< Scatter/Gather DMA Mode: The core ignores the frame number, sending
                                                          packets immediately as the packets are ready.Non-Scatter/Gather DMA
                                                          Mode: Periodic Transfer Interrupt feature is enabled.*/

/* NAKONBBLE @Bit 16 : NAK on Babble Error (NakOnBble) */
  #define USBHSCORE_DCTL_NAKONBBLE_Pos (16UL)        /*!< Position of NAKONBBLE field.                                         */
  #define USBHSCORE_DCTL_NAKONBBLE_Msk (0x1UL << USBHSCORE_DCTL_NAKONBBLE_Pos) /*!< Bit mask of NAKONBBLE field.               */
  #define USBHSCORE_DCTL_NAKONBBLE_Min (0x0UL)       /*!< Min enumerator value of NAKONBBLE field.                             */
  #define USBHSCORE_DCTL_NAKONBBLE_Max (0x1UL)       /*!< Max enumerator value of NAKONBBLE field.                             */
  #define USBHSCORE_DCTL_NAKONBBLE_DISABLED (0x0UL)  /*!< Disable NAK on Babble Error                                          */
  #define USBHSCORE_DCTL_NAKONBBLE_ENABLED (0x1UL)   /*!< NAK on Babble Error                                                  */

/* DEEPSLEEPBESLREJECT @Bit 18 : DeepSleepBESLReject */
  #define USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_Pos (18UL) /*!< Position of DEEPSLEEPBESLREJECT field.                            */
  #define USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_Msk (0x1UL << USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_Pos) /*!< Bit mask of
                                                                            DEEPSLEEPBESLREJECT field.*/
  #define USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_Min (0x0UL) /*!< Min enumerator value of DEEPSLEEPBESLREJECT field.               */
  #define USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_Max (0x1UL) /*!< Max enumerator value of DEEPSLEEPBESLREJECT field.               */
  #define USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_DISABLED (0x0UL) /*!< Deep Sleep BESL Reject feature is disabled                  */
  #define USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_ENABLED (0x1UL) /*!< Deep Sleep BESL Reject feature is enabled                    */

/* SERVINT @Bit 19 : Service Interval based scheduling for Isochronous IN Endpoints */
  #define USBHSCORE_DCTL_SERVINT_Pos (19UL)          /*!< Position of SERVINT field.                                           */
  #define USBHSCORE_DCTL_SERVINT_Msk (0x1UL << USBHSCORE_DCTL_SERVINT_Pos) /*!< Bit mask of SERVINT field.                     */
  #define USBHSCORE_DCTL_SERVINT_Min (0x0UL)         /*!< Min enumerator value of SERVINT field.                               */
  #define USBHSCORE_DCTL_SERVINT_Max (0x1UL)         /*!< Max enumerator value of SERVINT field.                               */
  #define USBHSCORE_DCTL_SERVINT_DISABLED (0x0UL)    /*!< The controller behavior depends on DCTL.IgnrFrmNum field.            */
  #define USBHSCORE_DCTL_SERVINT_ENABLED (0x1UL)     /*!< Scatter/Gather DMA Mode: The controller can transmit the packets in
                                                          any frame of the service interval.*/

/* UTMITERMSELCORRDIS @Bit 31 : Disable the correction of TermSel on UTMI Interface. */
  #define USBHSCORE_DCTL_UTMITERMSELCORRDIS_Pos (31UL) /*!< Position of UTMITERMSELCORRDIS field.                              */
  #define USBHSCORE_DCTL_UTMITERMSELCORRDIS_Msk (0x1UL << USBHSCORE_DCTL_UTMITERMSELCORRDIS_Pos) /*!< Bit mask of
                                                                            UTMITERMSELCORRDIS field.*/
  #define USBHSCORE_DCTL_UTMITERMSELCORRDIS_Min (0x0UL) /*!< Min enumerator value of UTMITERMSELCORRDIS field.                 */
  #define USBHSCORE_DCTL_UTMITERMSELCORRDIS_Max (0x1UL) /*!< Max enumerator value of UTMITERMSELCORRDIS field.                 */
  #define USBHSCORE_DCTL_UTMITERMSELCORRDIS_DISABLED (0x0UL) /*!< Valid Combination of XcvrSel and TermSel is driven by the
                                                                  Device Controller.*/
  #define USBHSCORE_DCTL_UTMITERMSELCORRDIS_ENABLED (0x1UL) /*!< Invalid Combination of XcvrSel and TermSel is driven by the
                                                                 Device Controller.*/


/* USBHSCORE_DSTS: Device Status Register */
  #define USBHSCORE_DSTS_ResetValue (0x00000002UL)   /*!< Reset value of DSTS register.                                        */

/* SUSPSTS @Bit 0 : Suspend Status (SuspSts) */
  #define USBHSCORE_DSTS_SUSPSTS_Pos (0UL)           /*!< Position of SUSPSTS field.                                           */
  #define USBHSCORE_DSTS_SUSPSTS_Msk (0x1UL << USBHSCORE_DSTS_SUSPSTS_Pos) /*!< Bit mask of SUSPSTS field.                     */
  #define USBHSCORE_DSTS_SUSPSTS_Min (0x0UL)         /*!< Min enumerator value of SUSPSTS field.                               */
  #define USBHSCORE_DSTS_SUSPSTS_Max (0x1UL)         /*!< Max enumerator value of SUSPSTS field.                               */
  #define USBHSCORE_DSTS_SUSPSTS_INACTIVE (0x0UL)    /*!< No suspend state                                                     */
  #define USBHSCORE_DSTS_SUSPSTS_ACTIVE (0x1UL)      /*!< Suspend state                                                        */

/* ENUMSPD @Bits 1..2 : Enumerated Speed (EnumSpd) */
  #define USBHSCORE_DSTS_ENUMSPD_Pos (1UL)           /*!< Position of ENUMSPD field.                                           */
  #define USBHSCORE_DSTS_ENUMSPD_Msk (0x3UL << USBHSCORE_DSTS_ENUMSPD_Pos) /*!< Bit mask of ENUMSPD field.                     */
  #define USBHSCORE_DSTS_ENUMSPD_Min (0x0UL)         /*!< Min enumerator value of ENUMSPD field.                               */
  #define USBHSCORE_DSTS_ENUMSPD_Max (0x3UL)         /*!< Max enumerator value of ENUMSPD field.                               */
  #define USBHSCORE_DSTS_ENUMSPD_HS3060 (0x0UL)      /*!< High speed (PHY clock is running at 30 or 60 MHz)                    */
  #define USBHSCORE_DSTS_ENUMSPD_FS3060 (0x1UL)      /*!< Full speed (PHY clock is running at 30 or 60 MHz)                    */
  #define USBHSCORE_DSTS_ENUMSPD_LS6 (0x2UL)         /*!< Low speed (PHY clock is running at 6 MHz)                            */
  #define USBHSCORE_DSTS_ENUMSPD_FS48 (0x3UL)        /*!< Full speed (PHY clock is running at 48 MHz)                          */

/* ERRTICERR @Bit 3 : Erratic Error (ErrticErr) */
  #define USBHSCORE_DSTS_ERRTICERR_Pos (3UL)         /*!< Position of ERRTICERR field.                                         */
  #define USBHSCORE_DSTS_ERRTICERR_Msk (0x1UL << USBHSCORE_DSTS_ERRTICERR_Pos) /*!< Bit mask of ERRTICERR field.               */
  #define USBHSCORE_DSTS_ERRTICERR_Min (0x0UL)       /*!< Min enumerator value of ERRTICERR field.                             */
  #define USBHSCORE_DSTS_ERRTICERR_Max (0x1UL)       /*!< Max enumerator value of ERRTICERR field.                             */
  #define USBHSCORE_DSTS_ERRTICERR_INACTIVE (0x0UL)  /*!< No Erratic Error                                                     */
  #define USBHSCORE_DSTS_ERRTICERR_ACTIVE (0x1UL)    /*!< Erratic Error                                                        */

/* SOFFN @Bits 8..21 : Frame or Microframe Number of the Received SOF (SOFFN) */
  #define USBHSCORE_DSTS_SOFFN_Pos (8UL)             /*!< Position of SOFFN field.                                             */
  #define USBHSCORE_DSTS_SOFFN_Msk (0x3FFFUL << USBHSCORE_DSTS_SOFFN_Pos) /*!< Bit mask of SOFFN field.                        */

/* DEVLNSTS @Bits 22..23 : Device Line Status (DevLnSts) */
  #define USBHSCORE_DSTS_DEVLNSTS_Pos (22UL)         /*!< Position of DEVLNSTS field.                                          */
  #define USBHSCORE_DSTS_DEVLNSTS_Msk (0x3UL << USBHSCORE_DSTS_DEVLNSTS_Pos) /*!< Bit mask of DEVLNSTS field.                  */


/* USBHSCORE_DIEPMSK: Device IN Endpoint Common Interrupt Mask Register */
  #define USBHSCORE_DIEPMSK_ResetValue (0x00000000UL) /*!< Reset value of DIEPMSK register.                                    */

/* XFERCOMPLMSK @Bit 0 : Transfer Completed Interrupt Mask (XferComplMsk) */
  #define USBHSCORE_DIEPMSK_XFERCOMPLMSK_Pos (0UL)   /*!< Position of XFERCOMPLMSK field.                                      */
  #define USBHSCORE_DIEPMSK_XFERCOMPLMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_XFERCOMPLMSK_Pos) /*!< Bit mask of XFERCOMPLMSK field.*/
  #define USBHSCORE_DIEPMSK_XFERCOMPLMSK_Min (0x0UL) /*!< Min enumerator value of XFERCOMPLMSK field.                          */
  #define USBHSCORE_DIEPMSK_XFERCOMPLMSK_Max (0x1UL) /*!< Max enumerator value of XFERCOMPLMSK field.                          */
  #define USBHSCORE_DIEPMSK_XFERCOMPLMSK_MASK (0x0UL) /*!< Mask Transfer Completed Interrupt                                   */
  #define USBHSCORE_DIEPMSK_XFERCOMPLMSK_NOMASK (0x1UL) /*!< No Transfer Completed Interrupt Mask                              */

