NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* INEPINT14 @Bit 14 : IN Endpoint 14 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT14_Pos (14UL)       /*!< Position of INEPINT14 field.                                         */
  #define USBHSCORE_DAINT_INEPINT14_Msk (0x1UL << USBHSCORE_DAINT_INEPINT14_Pos) /*!< Bit mask of INEPINT14 field.             */
  #define USBHSCORE_DAINT_INEPINT14_Min (0x0UL)      /*!< Min enumerator value of INEPINT14 field.                             */
  #define USBHSCORE_DAINT_INEPINT14_Max (0x1UL)      /*!< Max enumerator value of INEPINT14 field.                             */
  #define USBHSCORE_DAINT_INEPINT14_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT14_ACTIVE (0x1UL)   /*!< Interrupt is active for the IN EP                                    */

/* INEPINT15 @Bit 15 : IN Endpoint 15 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT15_Pos (15UL)       /*!< Position of INEPINT15 field.                                         */
  #define USBHSCORE_DAINT_INEPINT15_Msk (0x1UL << USBHSCORE_DAINT_INEPINT15_Pos) /*!< Bit mask of INEPINT15 field.             */
  #define USBHSCORE_DAINT_INEPINT15_Min (0x0UL)      /*!< Min enumerator value of INEPINT15 field.                             */
  #define USBHSCORE_DAINT_INEPINT15_Max (0x1UL)      /*!< Max enumerator value of INEPINT15 field.                             */
  #define USBHSCORE_DAINT_INEPINT15_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT15_ACTIVE (0x1UL)   /*!< Interrupt is active for the IN EP                                    */

/* OUTEPINT0 @Bit 16 : OUT Endpoint 0 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT0_Pos (16UL)       /*!< Position of OUTEPINT0 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT0_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT0_Pos) /*!< Bit mask of OUTEPINT0 field.             */
  #define USBHSCORE_DAINT_OUTEPINT0_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT0 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT0_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT0 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT0_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_OUTEPINT0_ACTIVE (0x1UL)   /*!< Interrupt is active for OUT EP0                                      */

/* OUTEPINT1 @Bit 17 : OUT Endpoint 1 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT1_Pos (17UL)       /*!< Position of OUTEPINT1 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT1_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT1_Pos) /*!< Bit mask of OUTEPINT1 field.             */
  #define USBHSCORE_DAINT_OUTEPINT1_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT1 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT1_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT1 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT1_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_OUTEPINT1_ACTIVE (0x1UL)   /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT2 @Bit 18 : OUT Endpoint 2 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT2_Pos (18UL)       /*!< Position of OUTEPINT2 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT2_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT2_Pos) /*!< Bit mask of OUTEPINT2 field.             */
  #define USBHSCORE_DAINT_OUTEPINT2_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT2 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT2_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT2 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT2_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_OUTEPINT2_ACTIVE (0x1UL)   /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT3 @Bit 19 : OUT Endpoint 3 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT3_Pos (19UL)       /*!< Position of OUTEPINT3 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT3_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT3_Pos) /*!< Bit mask of OUTEPINT3 field.             */
  #define USBHSCORE_DAINT_OUTEPINT3_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT3 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT3_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT3 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT3_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_OUTEPINT3_ACTIVE (0x1UL)   /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT4 @Bit 20 : OUT Endpoint 4 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT4_Pos (20UL)       /*!< Position of OUTEPINT4 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT4_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT4_Pos) /*!< Bit mask of OUTEPINT4 field.             */
  #define USBHSCORE_DAINT_OUTEPINT4_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT4 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT4_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT4 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT4_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_OUTEPINT4_ACTIVE (0x1UL)   /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT5 @Bit 21 : OUT Endpoint 5 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT5_Pos (21UL)       /*!< Position of OUTEPINT5 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT5_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT5_Pos) /*!< Bit mask of OUTEPINT5 field.             */
  #define USBHSCORE_DAINT_OUTEPINT5_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT5 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT5_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT5 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT5_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_OUTEPINT5_ACTIVE (0x1UL)   /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT6 @Bit 22 : OUT Endpoint 6 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT6_Pos (22UL)       /*!< Position of OUTEPINT6 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT6_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT6_Pos) /*!< Bit mask of OUTEPINT6 field.             */
  #define USBHSCORE_DAINT_OUTEPINT6_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT6 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT6_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT6 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT6_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_OUTEPINT6_ACTIVE (0x1UL)   /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT7 @Bit 23 : OUT Endpoint 7 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT7_Pos (23UL)       /*!< Position of OUTEPINT7 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT7_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT7_Pos) /*!< Bit mask of OUTEPINT7 field.             */
  #define USBHSCORE_DAINT_OUTEPINT7_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT7 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT7_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT7 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT7_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_OUTEPINT7_ACTIVE (0x1UL)   /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT8 @Bit 24 : OUT Endpoint 8 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT8_Pos (24UL)       /*!< Position of OUTEPINT8 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT8_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT8_Pos) /*!< Bit mask of OUTEPINT8 field.             */
  #define USBHSCORE_DAINT_OUTEPINT8_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT8 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT8_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT8 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT8_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_OUTEPINT8_ACTIVE (0x1UL)   /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT9 @Bit 25 : OUT Endpoint 9 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT9_Pos (25UL)       /*!< Position of OUTEPINT9 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT9_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT9_Pos) /*!< Bit mask of OUTEPINT9 field.             */
  #define USBHSCORE_DAINT_OUTEPINT9_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT9 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT9_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT9 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT9_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_OUTEPINT9_ACTIVE (0x1UL)   /*!< Interrupt is active for the OUT EP                                   */

