NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* INEPMSK3 @Bit 3 : IN Endpoint 3 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK3_Pos (3UL)      /*!< Position of INEPMSK3 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK3_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK3_Pos) /*!< Bit mask of INEPMSK3 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK3_Min (0x0UL)    /*!< Min enumerator value of INEPMSK3 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK3_Max (0x1UL)    /*!< Max enumerator value of INEPMSK3 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK3_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK3_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK4 @Bit 4 : IN Endpoint 4 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK4_Pos (4UL)      /*!< Position of INEPMSK4 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK4_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK4_Pos) /*!< Bit mask of INEPMSK4 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK4_Min (0x0UL)    /*!< Min enumerator value of INEPMSK4 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK4_Max (0x1UL)    /*!< Max enumerator value of INEPMSK4 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK4_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK4_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK5 @Bit 5 : IN Endpoint 5 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK5_Pos (5UL)      /*!< Position of INEPMSK5 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK5_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK5_Pos) /*!< Bit mask of INEPMSK5 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK5_Min (0x0UL)    /*!< Min enumerator value of INEPMSK5 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK5_Max (0x1UL)    /*!< Max enumerator value of INEPMSK5 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK5_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK5_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK6 @Bit 6 : IN Endpoint 6 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK6_Pos (6UL)      /*!< Position of INEPMSK6 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK6_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK6_Pos) /*!< Bit mask of INEPMSK6 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK6_Min (0x0UL)    /*!< Min enumerator value of INEPMSK6 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK6_Max (0x1UL)    /*!< Max enumerator value of INEPMSK6 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK6_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK6_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK7 @Bit 7 : IN Endpoint 7 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK7_Pos (7UL)      /*!< Position of INEPMSK7 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK7_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK7_Pos) /*!< Bit mask of INEPMSK7 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK7_Min (0x0UL)    /*!< Min enumerator value of INEPMSK7 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK7_Max (0x1UL)    /*!< Max enumerator value of INEPMSK7 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK7_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK7_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK8 @Bit 8 : IN Endpoint 8 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK8_Pos (8UL)      /*!< Position of INEPMSK8 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK8_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK8_Pos) /*!< Bit mask of INEPMSK8 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK8_Min (0x0UL)    /*!< Min enumerator value of INEPMSK8 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK8_Max (0x1UL)    /*!< Max enumerator value of INEPMSK8 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK8_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK8_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK9 @Bit 9 : IN Endpoint 9 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK9_Pos (9UL)      /*!< Position of INEPMSK9 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK9_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK9_Pos) /*!< Bit mask of INEPMSK9 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK9_Min (0x0UL)    /*!< Min enumerator value of INEPMSK9 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK9_Max (0x1UL)    /*!< Max enumerator value of INEPMSK9 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK9_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK9_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK10 @Bit 10 : IN Endpoint 10 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK10_Pos (10UL)    /*!< Position of INEPMSK10 field.                                         */
  #define USBHSCORE_DAINTMSK_INEPMSK10_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK10_Pos) /*!< Bit mask of INEPMSK10 field.       */
  #define USBHSCORE_DAINTMSK_INEPMSK10_Min (0x0UL)   /*!< Min enumerator value of INEPMSK10 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK10_Max (0x1UL)   /*!< Max enumerator value of INEPMSK10 field.                             */
  #define USBHSCORE_DAINTMSK_INEPMSK10_MASK (0x0UL)  /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK10_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

