NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* OUTEPMSK5 @Bit 21 : OUT Endpoint 5 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_Pos (21UL)    /*!< Position of OUTEPMSK5 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK5_Pos) /*!< Bit mask of OUTEPMSK5 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK5 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK5 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_MASK (0x0UL)  /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* OUTEPMSK6 @Bit 22 : OUT Endpoint 6 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK6_Pos (22UL)    /*!< Position of OUTEPMSK6 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK6_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK6_Pos) /*!< Bit mask of OUTEPMSK6 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK6_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK6 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK6_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK6 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK6_MASK (0x0UL)  /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK6_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* OUTEPMSK7 @Bit 23 : OUT Endpoint 7 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK7_Pos (23UL)    /*!< Position of OUTEPMSK7 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK7_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK7_Pos) /*!< Bit mask of OUTEPMSK7 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK7_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK7 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK7_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK7 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK7_MASK (0x0UL)  /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK7_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* OUTEPMSK8 @Bit 24 : OUT Endpoint 8 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK8_Pos (24UL)    /*!< Position of OUTEPMSK8 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK8_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK8_Pos) /*!< Bit mask of OUTEPMSK8 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK8_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK8 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK8_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK8 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK8_MASK (0x0UL)  /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK8_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* OUTEPMSK9 @Bit 25 : OUT Endpoint 9 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK9_Pos (25UL)    /*!< Position of OUTEPMSK9 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK9_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK9_Pos) /*!< Bit mask of OUTEPMSK9 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK9_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK9 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK9_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK9 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK9_MASK (0x0UL)  /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK9_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* OUTEPMSK10 @Bit 26 : OUT Endpoint 10 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK10_Pos (26UL)   /*!< Position of OUTEPMSK10 field.                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK10_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK10_Pos) /*!< Bit mask of OUTEPMSK10 field.    */
  #define USBHSCORE_DAINTMSK_OUTEPMSK10_Min (0x0UL)  /*!< Min enumerator value of OUTEPMSK10 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK10_Max (0x1UL)  /*!< Max enumerator value of OUTEPMSK10 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK10_MASK (0x0UL) /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK10_NOMASK (0x1UL) /*!< No Interrupt mask                                                  */

/* OUTEPMSK11 @Bit 27 : OUT Endpoint 11 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK11_Pos (27UL)   /*!< Position of OUTEPMSK11 field.                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK11_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK11_Pos) /*!< Bit mask of OUTEPMSK11 field.    */
  #define USBHSCORE_DAINTMSK_OUTEPMSK11_Min (0x0UL)  /*!< Min enumerator value of OUTEPMSK11 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK11_Max (0x1UL)  /*!< Max enumerator value of OUTEPMSK11 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK11_MASK (0x0UL) /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK11_NOMASK (0x1UL) /*!< No Interrupt mask                                                  */

/* OUTEPMSK12 @Bit 28 : OUT Endpoint 12 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_Pos (28UL)   /*!< Position of OUTEPMSK12 field.                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK12_Pos) /*!< Bit mask of OUTEPMSK12 field.    */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_Min (0x0UL)  /*!< Min enumerator value of OUTEPMSK12 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_Max (0x1UL)  /*!< Max enumerator value of OUTEPMSK12 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_MASK (0x0UL) /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_NOMASK (0x1UL) /*!< No Interrupt mask                                                  */

/* OUTEPMSK13 @Bit 29 : OUT Endpoint 13 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_Pos (29UL)   /*!< Position of OUTEPMSK13 field.                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK13_Pos) /*!< Bit mask of OUTEPMSK13 field.    */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_Min (0x0UL)  /*!< Min enumerator value of OUTEPMSK13 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_Max (0x1UL)  /*!< Max enumerator value of OUTEPMSK13 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_MASK (0x0UL) /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_NOMASK (0x1UL) /*!< No Interrupt mask                                                  */

