NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* OUTEPMSK14 @Bit 30 : OUT Endpoint 14 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_Pos (30UL)   /*!< Position of OUTEPMSK14 field.                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK14_Pos) /*!< Bit mask of OUTEPMSK14 field.    */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_Min (0x0UL)  /*!< Min enumerator value of OUTEPMSK14 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_Max (0x1UL)  /*!< Max enumerator value of OUTEPMSK14 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_MASK (0x0UL) /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_NOMASK (0x1UL) /*!< No Interrupt mask                                                  */

/* OUTEPMSK15 @Bit 31 : OUT Endpoint 15 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_Pos (31UL)   /*!< Position of OUTEPMSK15 field.                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK15_Pos) /*!< Bit mask of OUTEPMSK15 field.    */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_Min (0x0UL)  /*!< Min enumerator value of OUTEPMSK15 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_Max (0x1UL)  /*!< Max enumerator value of OUTEPMSK15 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_MASK (0x0UL) /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_NOMASK (0x1UL) /*!< No Interrupt mask                                                  */


/* USBHSCORE_DVBUSDIS: Device VBUS Discharge Time Register */
  #define USBHSCORE_DVBUSDIS_ResetValue (0x000017D7UL) /*!< Reset value of DVBUSDIS register.                                  */

/* DVBUSDIS @Bits 0..15 : Device VBUS Discharge Time (DVBUSDis) */
  #define USBHSCORE_DVBUSDIS_DVBUSDIS_Pos (0UL)      /*!< Position of DVBUSDIS field.                                          */
  #define USBHSCORE_DVBUSDIS_DVBUSDIS_Msk (0xFFFFUL << USBHSCORE_DVBUSDIS_DVBUSDIS_Pos) /*!< Bit mask of DVBUSDIS field.       */


/* USBHSCORE_DVBUSPULSE: Device VBUS Pulsing Time Register */
  #define USBHSCORE_DVBUSPULSE_ResetValue (0x000005B8UL) /*!< Reset value of DVBUSPULSE register.                              */

/* DVBUSPULSE @Bits 0..11 : Device VBUS Pulsing Time (DVBUSPulse) */
  #define USBHSCORE_DVBUSPULSE_DVBUSPULSE_Pos (0UL)  /*!< Position of DVBUSPULSE field.                                        */
  #define USBHSCORE_DVBUSPULSE_DVBUSPULSE_Msk (0xFFFUL << USBHSCORE_DVBUSPULSE_DVBUSPULSE_Pos) /*!< Bit mask of DVBUSPULSE
                                                                            field.*/


/* USBHSCORE_DTHRCTL: Device Threshold Control Register */
  #define USBHSCORE_DTHRCTL_ResetValue (0x08100020UL) /*!< Reset value of DTHRCTL register.                                    */

/* NONISOTHREN @Bit 0 : Non-ISO IN Endpoints Threshold Enable. (NonISOThrEn) */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_Pos (0UL)    /*!< Position of NONISOTHREN field.                                       */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_Msk (0x1UL << USBHSCORE_DTHRCTL_NONISOTHREN_Pos) /*!< Bit mask of NONISOTHREN field.   */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_Min (0x0UL)  /*!< Min enumerator value of NONISOTHREN field.                           */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_Max (0x1UL)  /*!< Max enumerator value of NONISOTHREN field.                           */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_DISABLED (0x0UL) /*!< No thresholding                                                  */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_ENABLED (0x1UL) /*!< Enable thresholding for non-isochronous IN endpoints              */

/* ISOTHREN @Bit 1 : (unspecified) */
  #define USBHSCORE_DTHRCTL_ISOTHREN_Pos (1UL)       /*!< Position of ISOTHREN field.                                          */
  #define USBHSCORE_DTHRCTL_ISOTHREN_Msk (0x1UL << USBHSCORE_DTHRCTL_ISOTHREN_Pos) /*!< Bit mask of ISOTHREN field.            */
  #define USBHSCORE_DTHRCTL_ISOTHREN_Min (0x0UL)     /*!< Min enumerator value of ISOTHREN field.                              */
  #define USBHSCORE_DTHRCTL_ISOTHREN_Max (0x1UL)     /*!< Max enumerator value of ISOTHREN field.                              */
  #define USBHSCORE_DTHRCTL_ISOTHREN_DISABLED (0x0UL) /*!< No thresholding                                                     */
  #define USBHSCORE_DTHRCTL_ISOTHREN_ENABLED (0x1UL) /*!< Enables thresholding for isochronous IN endpoints                    */

/* TXTHRLEN @Bits 2..10 : Transmit Threshold Length (TxThrLen) */
  #define USBHSCORE_DTHRCTL_TXTHRLEN_Pos (2UL)       /*!< Position of TXTHRLEN field.                                          */
  #define USBHSCORE_DTHRCTL_TXTHRLEN_Msk (0x1FFUL << USBHSCORE_DTHRCTL_TXTHRLEN_Pos) /*!< Bit mask of TXTHRLEN field.          */

/* AHBTHRRATIO @Bits 11..12 : AHB Threshold Ratio (AHBThrRatio) */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_Pos (11UL)   /*!< Position of AHBTHRRATIO field.                                       */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_Msk (0x3UL << USBHSCORE_DTHRCTL_AHBTHRRATIO_Pos) /*!< Bit mask of AHBTHRRATIO field.   */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_Min (0x0UL)  /*!< Min enumerator value of AHBTHRRATIO field.                           */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_Max (0x3UL)  /*!< Max enumerator value of AHBTHRRATIO field.                           */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_THRESZERO (0x0UL) /*!< AHB threshold = MAC threshold                                   */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_THRESONE (0x1UL) /*!< AHB threshold = MAC threshold /2                                 */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_THRESTWO (0x2UL) /*!< AHB threshold = MAC threshold /4                                 */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_THRESTHREE (0x3UL) /*!< AHB threshold = MAC threshold /8                               */

/* RXTHREN @Bit 16 : Receive Threshold Enable (RxThrEn) */
  #define USBHSCORE_DTHRCTL_RXTHREN_Pos (16UL)       /*!< Position of RXTHREN field.                                           */
  #define USBHSCORE_DTHRCTL_RXTHREN_Msk (0x1UL << USBHSCORE_DTHRCTL_RXTHREN_Pos) /*!< Bit mask of RXTHREN field.               */
  #define USBHSCORE_DTHRCTL_RXTHREN_Min (0x0UL)      /*!< Min enumerator value of RXTHREN field.                               */
  #define USBHSCORE_DTHRCTL_RXTHREN_Max (0x1UL)      /*!< Max enumerator value of RXTHREN field.                               */
  #define USBHSCORE_DTHRCTL_RXTHREN_DISABLED (0x0UL) /*!< Disable thresholding                                                 */
  #define USBHSCORE_DTHRCTL_RXTHREN_ENABLED (0x1UL)  /*!< Enable thresholding in the receive direction                         */

/* RXTHRLEN @Bits 17..25 : Receive Threshold Length (RxThrLen) */
  #define USBHSCORE_DTHRCTL_RXTHRLEN_Pos (17UL)      /*!< Position of RXTHRLEN field.                                          */
  #define USBHSCORE_DTHRCTL_RXTHRLEN_Msk (0x1FFUL << USBHSCORE_DTHRCTL_RXTHRLEN_Pos) /*!< Bit mask of RXTHRLEN field.          */

/* ARBPRKEN @Bit 27 : Arbiter Parking Enable (ArbPrkEn) */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_Pos (27UL)      /*!< Position of ARBPRKEN field.                                          */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_Msk (0x1UL << USBHSCORE_DTHRCTL_ARBPRKEN_Pos) /*!< Bit mask of ARBPRKEN field.            */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_Min (0x0UL)     /*!< Min enumerator value of ARBPRKEN field.                              */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_Max (0x1UL)     /*!< Max enumerator value of ARBPRKEN field.                              */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_DISABLED (0x0UL) /*!< Disable DMA arbiter parking                                         */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_ENABLED (0x1UL) /*!< Enable DMA arbiter parking for IN endpoints                          */


/* USBHSCORE_DIEPEMPMSK: Device IN Endpoint FIFO Empty Interrupt Mask Register */
  #define USBHSCORE_DIEPEMPMSK_ResetValue (0x00000000UL) /*!< Reset value of DIEPEMPMSK register.                              */

/* INEPTXFEMPMSK @Bits 0..15 : IN EP Tx FIFO Empty Interrupt Mask Bits (InEpTxfEmpMsk) */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Pos (0UL) /*!< Position of INEPTXFEMPMSK field.                                   */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Msk (0xFFFFUL << USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Pos) /*!< Bit mask of
                                                                            INEPTXFEMPMSK field.*/
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Min (0x0001UL) /*!< Min enumerator value of INEPTXFEMPMSK field.                  */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Max (0x8000UL) /*!< Max enumerator value of INEPTXFEMPMSK field.                  */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP0MASK (0x0001UL) /*!< Mask IN EP0 Tx FIFO Empty Interrupt                       */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP1MASK (0x0002UL) /*!< Mask IN EP1 Tx FIFO Empty Interrupt                       */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP2MASK (0x0004UL) /*!< Mask IN EP2 Tx FIFO Empty Interrupt                       */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP3MASK (0x0008UL) /*!< Mask IN EP3 Tx FIFO Empty Interrupt                       */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP4MASK (0x0010UL) /*!< Mask IN EP4 Tx FIFO Empty Interrupt                       */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP5MASK (0x0020UL) /*!< Mask IN EP5 Tx FIFO Empty Interrupt                       */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP6MASK (0x0040UL) /*!< Mask IN EP6 Tx FIFO Empty Interrupt                       */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP7MASK (0x0080UL) /*!< Mask IN EP7 Tx FIFO Empty Interrupt                       */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP8MASK (0x0100UL) /*!< Mask IN EP8 Tx FIFO Empty Interrupt                       */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP9MASK (0x0200UL) /*!< Mask IN EP9 Tx FIFO Empty Interrupt                       */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP10MASK (0x0400UL) /*!< Mask IN EP10 Tx FIFO Empty Interrupt                     */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP11MASK (0x0800UL) /*!< Mask IN EP11 Tx FIFO Empty Interrupt                     */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP12MASK (0x1000UL) /*!< Mask IN EP12 Tx FIFO Empty Interrupt                     */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP13MASK (0x2000UL) /*!< Mask IN EP13 Tx FIFO Empty Interrupt                     */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP14MASK (0x4000UL) /*!< Mask IN EP14 Tx FIFO Empty Interrupt                     */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP15MASK (0x8000UL) /*!< Mask IN EP15 Tx FIFO Empty Interrupt                     */


