NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DIEPCTL10_STALL_Pos (21UL)       /*!< Position of STALL field.                                             */
  #define USBHSCORE_DIEPCTL10_STALL_Msk (0x1UL << USBHSCORE_DIEPCTL10_STALL_Pos) /*!< Bit mask of STALL field.                 */
  #define USBHSCORE_DIEPCTL10_STALL_Min (0x0UL)      /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_DIEPCTL10_STALL_Max (0x1UL)      /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_DIEPCTL10_STALL_INACTIVE (0x0UL) /*!< STALL All non-active tokens                                          */
  #define USBHSCORE_DIEPCTL10_STALL_ACTIVE (0x1UL)   /*!< STALL All Active Tokens                                              */

/* TXFNUM @Bits 22..25 : TxFIFO Number (TxFNum) */
  #define USBHSCORE_DIEPCTL10_TXFNUM_Pos (22UL)      /*!< Position of TXFNUM field.                                            */
  #define USBHSCORE_DIEPCTL10_TXFNUM_Msk (0xFUL << USBHSCORE_DIEPCTL10_TXFNUM_Pos) /*!< Bit mask of TXFNUM field.              */
  #define USBHSCORE_DIEPCTL10_TXFNUM_Min (0x0UL)     /*!< Min enumerator value of TXFNUM field.                                */
  #define USBHSCORE_DIEPCTL10_TXFNUM_Max (0xFUL)     /*!< Max enumerator value of TXFNUM field.                                */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO0 (0x0UL) /*!< Tx FIFO 0                                                            */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO1 (0x1UL) /*!< Tx FIFO 1                                                            */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO2 (0x2UL) /*!< Tx FIFO 2                                                            */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO3 (0x3UL) /*!< Tx FIFO 3                                                            */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO4 (0x4UL) /*!< Tx FIFO 4                                                            */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO5 (0x5UL) /*!< Tx FIFO 5                                                            */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO6 (0x6UL) /*!< Tx FIFO 6                                                            */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO7 (0x7UL) /*!< Tx FIFO 7                                                            */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO8 (0x8UL) /*!< Tx FIFO 8                                                            */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO9 (0x9UL) /*!< Tx FIFO 9                                                            */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO10 (0xAUL) /*!< Tx FIFO 10                                                          */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO11 (0xBUL) /*!< Tx FIFO 11                                                          */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO12 (0xCUL) /*!< Tx FIFO 12                                                          */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO13 (0xDUL) /*!< Tx FIFO 13                                                          */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO14 (0xEUL) /*!< Tx FIFO 14                                                          */
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO15 (0xFUL) /*!< Tx FIFO 15                                                          */

/* CNAK @Bit 26 : Clear NAK (CNAK) */
  #define USBHSCORE_DIEPCTL10_CNAK_Pos (26UL)        /*!< Position of CNAK field.                                              */
  #define USBHSCORE_DIEPCTL10_CNAK_Msk (0x1UL << USBHSCORE_DIEPCTL10_CNAK_Pos) /*!< Bit mask of CNAK field.                    */
  #define USBHSCORE_DIEPCTL10_CNAK_Min (0x0UL)       /*!< Min enumerator value of CNAK field.                                  */
  #define USBHSCORE_DIEPCTL10_CNAK_Max (0x1UL)       /*!< Max enumerator value of CNAK field.                                  */
  #define USBHSCORE_DIEPCTL10_CNAK_INACTIVE (0x0UL)  /*!< No Clear NAK                                                         */
  #define USBHSCORE_DIEPCTL10_CNAK_ACTIVE (0x1UL)    /*!< Clear NAK                                                            */

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DIEPCTL10_SNAK_Pos (27UL)        /*!< Position of SNAK field.                                              */
  #define USBHSCORE_DIEPCTL10_SNAK_Msk (0x1UL << USBHSCORE_DIEPCTL10_SNAK_Pos) /*!< Bit mask of SNAK field.                    */
  #define USBHSCORE_DIEPCTL10_SNAK_Min (0x0UL)       /*!< Min enumerator value of SNAK field.                                  */
  #define USBHSCORE_DIEPCTL10_SNAK_Max (0x1UL)       /*!< Max enumerator value of SNAK field.                                  */
  #define USBHSCORE_DIEPCTL10_SNAK_INACTIVE (0x0UL)  /*!< No Set NAK                                                           */
  #define USBHSCORE_DIEPCTL10_SNAK_ACTIVE (0x1UL)    /*!< Set NAK                                                              */

/* SETD0PID @Bit 28 : Set DATA0 PID (SetD0PID) */
  #define USBHSCORE_DIEPCTL10_SETD0PID_Pos (28UL)    /*!< Position of SETD0PID field.                                          */
  #define USBHSCORE_DIEPCTL10_SETD0PID_Msk (0x1UL << USBHSCORE_DIEPCTL10_SETD0PID_Pos) /*!< Bit mask of SETD0PID field.        */
  #define USBHSCORE_DIEPCTL10_SETD0PID_Min (0x0UL)   /*!< Min enumerator value of SETD0PID field.                              */
  #define USBHSCORE_DIEPCTL10_SETD0PID_Max (0x1UL)   /*!< Max enumerator value of SETD0PID field.                              */
  #define USBHSCORE_DIEPCTL10_SETD0PID_DISABLED (0x0UL) /*!< Disables Set DATA0 PID or Do not force Even (micro)Frame          */
  #define USBHSCORE_DIEPCTL10_SETD0PID_ENABLED (0x1UL) /*!< Set Endpoint Data PID to DATA0 or Sets EO_FrNum field to Even
                                                            (micro)Frame*/

/* SETD1PID @Bit 29 : Set DATA1 PID (SetD1PID) */
  #define USBHSCORE_DIEPCTL10_SETD1PID_Pos (29UL)    /*!< Position of SETD1PID field.                                          */
  #define USBHSCORE_DIEPCTL10_SETD1PID_Msk (0x1UL << USBHSCORE_DIEPCTL10_SETD1PID_Pos) /*!< Bit mask of SETD1PID field.        */
  #define USBHSCORE_DIEPCTL10_SETD1PID_Min (0x0UL)   /*!< Min enumerator value of SETD1PID field.                              */
  #define USBHSCORE_DIEPCTL10_SETD1PID_Max (0x1UL)   /*!< Max enumerator value of SETD1PID field.                              */
  #define USBHSCORE_DIEPCTL10_SETD1PID_DISABLED (0x0UL) /*!< Disables Set DATA1 PID or Do not force Odd (micro)Frame           */
  #define USBHSCORE_DIEPCTL10_SETD1PID_ENABLED (0x1UL) /*!< Set Endpoint Data PID to DATA1 or Sets EO_FrNum field to Odd
                                                            (micro)Frame*/

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DIEPCTL10_EPDIS_Pos (30UL)       /*!< Position of EPDIS field.                                             */
  #define USBHSCORE_DIEPCTL10_EPDIS_Msk (0x1UL << USBHSCORE_DIEPCTL10_EPDIS_Pos) /*!< Bit mask of EPDIS field.                 */
  #define USBHSCORE_DIEPCTL10_EPDIS_Min (0x0UL)      /*!< Min enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DIEPCTL10_EPDIS_Max (0x1UL)      /*!< Max enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DIEPCTL10_EPDIS_INACTIVE (0x0UL) /*!< No Action                                                            */
  #define USBHSCORE_DIEPCTL10_EPDIS_ACTIVE (0x1UL)   /*!< Disable Endpoint                                                     */

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DIEPCTL10_EPENA_Pos (31UL)       /*!< Position of EPENA field.                                             */
  #define USBHSCORE_DIEPCTL10_EPENA_Msk (0x1UL << USBHSCORE_DIEPCTL10_EPENA_Pos) /*!< Bit mask of EPENA field.                 */
  #define USBHSCORE_DIEPCTL10_EPENA_Min (0x0UL)      /*!< Min enumerator value of EPENA field.                                 */
  #define USBHSCORE_DIEPCTL10_EPENA_Max (0x1UL)      /*!< Max enumerator value of EPENA field.                                 */
  #define USBHSCORE_DIEPCTL10_EPENA_INACTIVE (0x0UL) /*!< No Action                                                            */
  #define USBHSCORE_DIEPCTL10_EPENA_ACTIVE (0x1UL)   /*!< Enable Endpoint                                                      */


/* USBHSCORE_DIEPINT10: Device IN Endpoint Interrupt Register 10 */
  #define USBHSCORE_DIEPINT10_ResetValue (0x00000080UL) /*!< Reset value of DIEPINT10 register.                                */

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_Pos (0UL)    /*!< Position of XFERCOMPL field.                                         */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_Msk (0x1UL << USBHSCORE_DIEPINT10_XFERCOMPL_Pos) /*!< Bit mask of XFERCOMPL field.     */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_Min (0x0UL)  /*!< Min enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_Max (0x1UL)  /*!< Max enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_INACTIVE (0x0UL) /*!< No Transfer Complete Interrupt                                   */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_ACTIVE (0x1UL) /*!< Transfer Complete Interrupt                                        */

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DIEPINT10_EPDISBLD_Pos (1UL)     /*!< Position of EPDISBLD field.                                          */
  #define USBHSCORE_DIEPINT10_EPDISBLD_Msk (0x1UL << USBHSCORE_DIEPINT10_EPDISBLD_Pos) /*!< Bit mask of EPDISBLD field.        */
  #define USBHSCORE_DIEPINT10_EPDISBLD_Min (0x0UL)   /*!< Min enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DIEPINT10_EPDISBLD_Max (0x1UL)   /*!< Max enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DIEPINT10_EPDISBLD_INACTIVE (0x0UL) /*!< No Endpoint Disabled Interrupt                                    */
  #define USBHSCORE_DIEPINT10_EPDISBLD_ACTIVE (0x1UL) /*!< Endpoint Disabled Interrupt                                         */

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DIEPINT10_AHBERR_Pos (2UL)       /*!< Position of AHBERR field.                                            */
  #define USBHSCORE_DIEPINT10_AHBERR_Msk (0x1UL << USBHSCORE_DIEPINT10_AHBERR_Pos) /*!< Bit mask of AHBERR field.              */
  #define USBHSCORE_DIEPINT10_AHBERR_Min (0x0UL)     /*!< Min enumerator value of AHBERR field.                                */
  #define USBHSCORE_DIEPINT10_AHBERR_Max (0x1UL)     /*!< Max enumerator value of AHBERR field.                                */
  #define USBHSCORE_DIEPINT10_AHBERR_INACTIVE (0x0UL) /*!< No AHB Error Interrupt                                              */
  #define USBHSCORE_DIEPINT10_AHBERR_ACTIVE (0x1UL)  /*!< AHB Error interrupt                                                  */

/* TIMEOUT @Bit 3 : Timeout Condition (TimeOUT) */
  #define USBHSCORE_DIEPINT10_TIMEOUT_Pos (3UL)      /*!< Position of TIMEOUT field.                                           */
  #define USBHSCORE_DIEPINT10_TIMEOUT_Msk (0x1UL << USBHSCORE_DIEPINT10_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.           */
  #define USBHSCORE_DIEPINT10_TIMEOUT_Min (0x0UL)    /*!< Min enumerator value of TIMEOUT field.                               */
  #define USBHSCORE_DIEPINT10_TIMEOUT_Max (0x1UL)    /*!< Max enumerator value of TIMEOUT field.                               */
  #define USBHSCORE_DIEPINT10_TIMEOUT_INACTIVE (0x0UL) /*!< No Timeout interrupt                                               */
  #define USBHSCORE_DIEPINT10_TIMEOUT_ACTIVE (0x1UL) /*!< Timeout interrupt                                                    */

/* INTKNTXFEMP @Bit 4 : IN Token Received When TxFIFO is Empty (INTknTXFEmp) */
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_Pos (4UL)  /*!< Position of INTKNTXFEMP field.                                       */
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT10_INTKNTXFEMP_Pos) /*!< Bit mask of INTKNTXFEMP
                                                                            field.*/
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_Min (0x0UL) /*!< Min enumerator value of INTKNTXFEMP field.                          */
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_Max (0x1UL) /*!< Max enumerator value of INTKNTXFEMP field.                          */
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_INACTIVE (0x0UL) /*!< No IN Token Received interrupt                                 */
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_ACTIVE (0x1UL) /*!< IN Token Received Interrupt                                      */

/* INTKNEPMIS @Bit 5 : IN Token Received with EP Mismatch (INTknEPMis) */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_Pos (5UL)   /*!< Position of INTKNEPMIS field.                                        */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_Msk (0x1UL << USBHSCORE_DIEPINT10_INTKNEPMIS_Pos) /*!< Bit mask of INTKNEPMIS field.  */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_Min (0x0UL) /*!< Min enumerator value of INTKNEPMIS field.                            */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_Max (0x1UL) /*!< Max enumerator value of INTKNEPMIS field.                            */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_INACTIVE (0x0UL) /*!< No IN Token Received with EP Mismatch interrupt                 */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_ACTIVE (0x1UL) /*!< IN Token Received with EP Mismatch interrupt                      */

