NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DOEPINT0_BNAINTR_Pos (9UL)       /*!< Position of BNAINTR field.                                           */
  #define USBHSCORE_DOEPINT0_BNAINTR_Msk (0x1UL << USBHSCORE_DOEPINT0_BNAINTR_Pos) /*!< Bit mask of BNAINTR field.             */
  #define USBHSCORE_DOEPINT0_BNAINTR_Min (0x0UL)     /*!< Min enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DOEPINT0_BNAINTR_Max (0x1UL)     /*!< Max enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DOEPINT0_BNAINTR_INACTIVE (0x0UL) /*!< No BNA interrupt                                                    */
  #define USBHSCORE_DOEPINT0_BNAINTR_ACTIVE (0x1UL)  /*!< BNA interrupt                                                        */

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DOEPINT0_PKTDRPSTS_Pos (11UL)    /*!< Position of PKTDRPSTS field.                                         */
  #define USBHSCORE_DOEPINT0_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DOEPINT0_PKTDRPSTS_Pos) /*!< Bit mask of PKTDRPSTS field.       */
  #define USBHSCORE_DOEPINT0_PKTDRPSTS_Min (0x0UL)   /*!< Min enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DOEPINT0_PKTDRPSTS_Max (0x1UL)   /*!< Max enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DOEPINT0_PKTDRPSTS_INACTIVE (0x0UL) /*!< No interrupt                                                      */
  #define USBHSCORE_DOEPINT0_PKTDRPSTS_ACTIVE (0x1UL) /*!< Packet Drop Status interrupt                                        */

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DOEPINT0_BBLEERR_Pos (12UL)      /*!< Position of BBLEERR field.                                           */
  #define USBHSCORE_DOEPINT0_BBLEERR_Msk (0x1UL << USBHSCORE_DOEPINT0_BBLEERR_Pos) /*!< Bit mask of BBLEERR field.             */
  #define USBHSCORE_DOEPINT0_BBLEERR_Min (0x0UL)     /*!< Min enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DOEPINT0_BBLEERR_Max (0x1UL)     /*!< Max enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DOEPINT0_BBLEERR_INACTIVE (0x0UL) /*!< No BbleErr interrupt                                                */
  #define USBHSCORE_DOEPINT0_BBLEERR_ACTIVE (0x1UL)  /*!< BbleErr interrupt                                                    */

/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DOEPINT0_NAKINTRPT_Pos (13UL)    /*!< Position of NAKINTRPT field.                                         */
  #define USBHSCORE_DOEPINT0_NAKINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT0_NAKINTRPT_Pos) /*!< Bit mask of NAKINTRPT field.       */
  #define USBHSCORE_DOEPINT0_NAKINTRPT_Min (0x0UL)   /*!< Min enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DOEPINT0_NAKINTRPT_Max (0x1UL)   /*!< Max enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DOEPINT0_NAKINTRPT_INACTIVE (0x0UL) /*!< No NAK interrupt                                                  */
  #define USBHSCORE_DOEPINT0_NAKINTRPT_ACTIVE (0x1UL) /*!< NAK Interrupt                                                       */

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DOEPINT0_NYETINTRPT_Pos (14UL)   /*!< Position of NYETINTRPT field.                                        */
  #define USBHSCORE_DOEPINT0_NYETINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT0_NYETINTRPT_Pos) /*!< Bit mask of NYETINTRPT field.    */
  #define USBHSCORE_DOEPINT0_NYETINTRPT_Min (0x0UL)  /*!< Min enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DOEPINT0_NYETINTRPT_Max (0x1UL)  /*!< Max enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DOEPINT0_NYETINTRPT_INACTIVE (0x0UL) /*!< No NYET interrupt                                                */
  #define USBHSCORE_DOEPINT0_NYETINTRPT_ACTIVE (0x1UL) /*!< NYET Interrupt                                                     */

/* STUPPKTRCVD @Bit 15 : Setup Packet Received */
  #define USBHSCORE_DOEPINT0_STUPPKTRCVD_Pos (15UL)  /*!< Position of STUPPKTRCVD field.                                       */
  #define USBHSCORE_DOEPINT0_STUPPKTRCVD_Msk (0x1UL << USBHSCORE_DOEPINT0_STUPPKTRCVD_Pos) /*!< Bit mask of STUPPKTRCVD field. */
  #define USBHSCORE_DOEPINT0_STUPPKTRCVD_Min (0x0UL) /*!< Min enumerator value of STUPPKTRCVD field.                           */
  #define USBHSCORE_DOEPINT0_STUPPKTRCVD_Max (0x1UL) /*!< Max enumerator value of STUPPKTRCVD field.                           */
  #define USBHSCORE_DOEPINT0_STUPPKTRCVD_NOTRCVD (0x0UL) /*!< No Setup packet received                                         */
  #define USBHSCORE_DOEPINT0_STUPPKTRCVD_RCVD (0x1UL) /*!< Setup packet received                                               */


/* USBHSCORE_DOEPTSIZ0: Device OUT Endpoint 0 Transfer Size Register */
  #define USBHSCORE_DOEPTSIZ0_ResetValue (0x00000000UL) /*!< Reset value of DOEPTSIZ0 register.                                */

/* XFERSIZE @Bits 0..6 : Transfer Size (XferSize) */
  #define USBHSCORE_DOEPTSIZ0_XFERSIZE_Pos (0UL)     /*!< Position of XFERSIZE field.                                          */
  #define USBHSCORE_DOEPTSIZ0_XFERSIZE_Msk (0x7FUL << USBHSCORE_DOEPTSIZ0_XFERSIZE_Pos) /*!< Bit mask of XFERSIZE field.       */

/* PKTCNT @Bit 19 : Packet Count (PktCnt) */
  #define USBHSCORE_DOEPTSIZ0_PKTCNT_Pos (19UL)      /*!< Position of PKTCNT field.                                            */
  #define USBHSCORE_DOEPTSIZ0_PKTCNT_Msk (0x1UL << USBHSCORE_DOEPTSIZ0_PKTCNT_Pos) /*!< Bit mask of PKTCNT field.              */

/* SUPCNT @Bits 29..30 : SETUP Packet Count (SUPCnt) */
  #define USBHSCORE_DOEPTSIZ0_SUPCNT_Pos (29UL)      /*!< Position of SUPCNT field.                                            */
  #define USBHSCORE_DOEPTSIZ0_SUPCNT_Msk (0x3UL << USBHSCORE_DOEPTSIZ0_SUPCNT_Pos) /*!< Bit mask of SUPCNT field.              */
  #define USBHSCORE_DOEPTSIZ0_SUPCNT_Min (0x1UL)     /*!< Min enumerator value of SUPCNT field.                                */
  #define USBHSCORE_DOEPTSIZ0_SUPCNT_Max (0x3UL)     /*!< Max enumerator value of SUPCNT field.                                */
  #define USBHSCORE_DOEPTSIZ0_SUPCNT_ONEPACKET (0x1UL) /*!< 1 packet                                                           */
  #define USBHSCORE_DOEPTSIZ0_SUPCNT_TWOPACKET (0x2UL) /*!< 2 packets                                                          */
  #define USBHSCORE_DOEPTSIZ0_SUPCNT_THREEPACKET (0x3UL) /*!< 3 packets                                                        */


/* USBHSCORE_DOEPDMA0: Device OUT Endpoint 0 DMA Address Register */
  #define USBHSCORE_DOEPDMA0_ResetValue (0x00000000UL) /*!< Reset value of DOEPDMA0 register.                                  */

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DOEPDMA0_DMAADDR_Pos (0UL)       /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_DOEPDMA0_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DOEPDMA0_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.      */


/* USBHSCORE_DOEPCTL1: Device Control OUT Endpoint Control Register 1 */
  #define USBHSCORE_DOEPCTL1_ResetValue (0x00000000UL) /*!< Reset value of DOEPCTL1 register.                                  */

