NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* EUSB2TERMINATERESUMEONDISCDIS @Bit 26 : Disable fix for Terminating Resume if UTMI HostDisconnect is detected. */
  #define USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_Pos (26UL) /*!< Position of EUSB2TERMINATERESUMEONDISCDIS field.  */
  #define USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_Pos)
                                                                            /*!< Bit mask of EUSB2TERMINATERESUMEONDISCDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_Min (0x0UL) /*!< Min enumerator value of
                                                                            EUSB2TERMINATERESUMEONDISCDIS field.*/
  #define USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_Max (0x1UL) /*!< Max enumerator value of
                                                                            EUSB2TERMINATERESUMEONDISCDIS field.*/
  #define USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_ENABLEFIX (0x0UL) /*!< Host controller terminates Resume if
                                                                            HostDisconnect is asserted*/
  #define USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_DISABLEFIX (0x1UL) /*!< Host controller does not terminate Resume
                                                                            if HostDisconnect is asserted*/

/* EUSB2FSLSDISCDETECTIONDIS @Bit 27 : Disable fix for FS/LS disconnect detection using UTMI HostDisconnect in MAC PRT. */
  #define USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_Pos (27UL) /*!< Position of EUSB2FSLSDISCDETECTIONDIS field.          */
  #define USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_Pos) /*!<
                                                                            Bit mask of EUSB2FSLSDISCDETECTIONDIS field.*/
  #define USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_Min (0x0UL) /*!< Min enumerator value of EUSB2FSLSDISCDETECTIONDIS
                                                                          field.*/
  #define USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_Max (0x1UL) /*!< Max enumerator value of EUSB2FSLSDISCDETECTIONDIS
                                                                          field.*/
  #define USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_ENABLEFIX (0x0UL) /*!< Host controller detects FS/LS disconnect using
                                                                            utmi_hostdisconnect signal*/
  #define USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_DISABLEFIX (0x1UL) /*!< Host controller detects disconnect by
                                                                            monitoring 2.5us of SE0 on DP/DM*/

/* HOSTFLUSHEXCESSTKNFIXDIS @Bit 29 : Disable fix for recovering the Host controller when sufficient time is not available in
                                      the current uF for an overscheduled ISOC OUT or INTR IN transfer. */

  #define USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_Pos (29UL) /*!< Position of HOSTFLUSHEXCESSTKNFIXDIS field.            */
  #define USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_Pos) /*!<
                                                                            Bit mask of HOSTFLUSHEXCESSTKNFIXDIS field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_Min (0x0UL) /*!< Min enumerator value of HOSTFLUSHEXCESSTKNFIXDIS
                                                                         field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_Max (0x1UL) /*!< Max enumerator value of HOSTFLUSHEXCESSTKNFIXDIS
                                                                         field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_ENABLEFIX (0x0UL) /*!< Host controller functionality is as expected if
                                                                            there is an overscheduled ISOC OUT or INTR IN
                                                                            transfer*/
  #define USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_DISABLEFIX (0x1UL) /*!< Host controller functionality cannot be
                                                                            determined if there is an overscheduled ISOC OUT or
                                                                            INTR IN transfer*/

/* TITRANSDONETGLDURINGISOCEOPFDISABLE @Bit 30 : Disable the fix added to not toggle ti_trans_done in SEND_EOP state when the
                                                 ISOC in tokens responds with zero length packets after end of periodic frame
                                                 till next start of frame. The fix is added when operating in descriptor dma
                                                 device mode. */

  #define USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_Pos (30UL) /*!< Position of
                                                                            TITRANSDONETGLDURINGISOCEOPFDISABLE field.*/
  #define USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_Msk (0x1UL << USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_Pos)
                                                                            /*!< Bit mask of TITRANSDONETGLDURINGISOCEOPFDISABLE
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_Min (0x0UL) /*!< Min enumerator value of
                                                                            TITRANSDONETGLDURINGISOCEOPFDISABLE field.*/
  #define USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_Max (0x1UL) /*!< Max enumerator value of
                                                                            TITRANSDONETGLDURINGISOCEOPFDISABLE field.*/
  #define USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_ENABLEFIX (0x0UL) /*!< ti_transdone is not toggled after eopf
                                                                            during ISOC IN transfer till next SOF*/
  #define USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_DISABLEFIX (0x1UL) /*!< ti_transdone is toggled after eopf
                                                                            during ISOC IN transfer till next SOF*/

/* CLEARSOFREFCLKTIMERDURINGDISC @Bit 31 : Disable the STAR fix added to clear the SOF refclk timer during disconnect detection.
                                           The STAR fix is added when using both UTMI and eUSB2 PHY. */

  #define USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_Pos (31UL) /*!< Position of CLEARSOFREFCLKTIMERDURINGDISC field.  */
  #define USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_Msk (0x1UL << USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_Pos)
                                                                            /*!< Bit mask of CLEARSOFREFCLKTIMERDURINGDISC
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_Min (0x0UL) /*!< Min enumerator value of
                                                                            CLEARSOFREFCLKTIMERDURINGDISC field.*/
  #define USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_Max (0x1UL) /*!< Max enumerator value of
                                                                            CLEARSOFREFCLKTIMERDURINGDISC field.*/
  #define USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_ENABLEFIX (0x0UL) /*!< SOF refclk timer is cleared immediately
                                                                            after device disconnect is detected.*/
  #define USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_DISABLEFIX (0x1UL) /*!< SOF refclk timer is not cleared immediately
                                                                            after device disconnect is detected.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                      VDMADESCRIPTOR                                      ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ================================================== Struct VDMADESCRIPTOR ================================================== */
/**
  * @brief Job descriptor for vector-based DMA.
  */
  typedef struct {                                   /*!< VDMADESCRIPTOR Structure                                             */
    __IOM uint32_t PTR;                              /*!< (@ 0x00000000) Pointer to data buffer.                               */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000004) Job configuration. Configuration of attributes and
                                                                         buffer length.*/
  } NRF_VDMADESCRIPTOR_Type;                         /*!< Size = 8 (0x008)                                                     */

/* VDMADESCRIPTOR_PTR: Pointer to data buffer. */
  #define VDMADESCRIPTOR_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                       */

/* PTR @Bits 0..31 : Pointer to data buffer. */
  #define VDMADESCRIPTOR_PTR_PTR_Pos (0UL)           /*!< Position of PTR field.                                               */
  #define VDMADESCRIPTOR_PTR_PTR_Msk (0xFFFFFFFFUL << VDMADESCRIPTOR_PTR_PTR_Pos) /*!< Bit mask of PTR field.                  */


/* VDMADESCRIPTOR_CONFIG: Job configuration. Configuration of attributes and buffer length. */
  #define VDMADESCRIPTOR_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                 */

/* CNT @Bits 0..23 : Maximum number of bytes in data buffer. */
  #define VDMADESCRIPTOR_CONFIG_CNT_Pos (0UL)        /*!< Position of CNT field.                                               */
  #define VDMADESCRIPTOR_CONFIG_CNT_Msk (0xFFFFFFUL << VDMADESCRIPTOR_CONFIG_CNT_Pos) /*!< Bit mask of CNT field.              */

/* ATTRIBUTE @Bits 24..29 : Job attribute. */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos (24UL) /*!< Position of ATTRIBUTE field.                                         */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Msk (0x3FUL << VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos) /*!< Bit mask of ATTRIBUTE field.*/
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Min (0x0BUL) /*!< Min enumerator value of ATTRIBUTE field.                           */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Max (0x0EUL) /*!< Max enumerator value of ATTRIBUTE field.                           */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_AarHash (0x0BUL) /*!< Hash attribute                                                 */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_AarPrand (0x0CUL) /*!< Prand attribute                                               */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_AarIrk (0x0DUL) /*!< Irk attribute                                                   */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_CcmAlen (0x0BUL) /*!< Alen attribute                                                 */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_CcmMlen (0x0CUL) /*!< Mlen attribute                                                 */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_CcmAdata (0x0DUL) /*!< Adata attribute                                               */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_CcmMdata (0x0EUL) /*!< Mdata attribute                                               */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_EcbData (0x0BUL) /*!< EcbData attribute                                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            VPR                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct VPR_DEBUGIF ==================================================== */
/**
  * @brief DEBUGIF [VPR_DEBUGIF] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  DATA0;                             /*!< (@ 0x00000010) Abstract Data 0. Read/write data for argument 0       */
  __IOM uint32_t  DATA1;                             /*!< (@ 0x00000014) Abstract Data 1. Read/write data for argument 1       */
  __IM  uint32_t  RESERVED1[10];
  __IOM uint32_t  DMCONTROL;                         /*!< (@ 0x00000040) Debug Module Control                                  */
  __IM  uint32_t  DMSTATUS;                          /*!< (@ 0x00000044) Debug Module Status                                   */
  __IOM uint32_t  HARTINFO;                          /*!< (@ 0x00000048) Hart Information                                      */
  __IOM uint32_t  HALTSUM1;                          /*!< (@ 0x0000004C) Halt Summary 1                                        */
  __IOM uint32_t  HAWINDOWSEL;                       /*!< (@ 0x00000050) Hart Array Window Select                              */
  __IOM uint32_t  HAWINDOW;                          /*!< (@ 0x00000054) Hart Array Window                                     */
  __IOM uint32_t  ABSTRACTCS;                        /*!< (@ 0x00000058) Abstract Control and Status                           */
  __OM  uint32_t  ABSTRACTCMD;                       /*!< (@ 0x0000005C) Abstract command                                      */
  __IOM uint32_t  ABSTRACTAUTO;                      /*!< (@ 0x00000060) Abstract Command Autoexec                             */
  __IOM uint32_t  CONFSTRPTR[4];                     /*!< (@ 0x00000064) Configuration String Pointer [n]                      */
  __IOM uint32_t  NEXTDM;                            /*!< (@ 0x00000074) Next Debug Module                                     */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  PROGBUF[16];                       /*!< (@ 0x00000080) Program Buffer [n]                                    */
  __IOM uint32_t  AUTHDATA;                          /*!< (@ 0x000000C0) Authentication Data                                   */
  __IM  uint32_t  RESERVED3[3];
  __IOM uint32_t  HALTSUM2;                          /*!< (@ 0x000000D0) Halt Summary 2                                        */
  __IOM uint32_t  HALTSUM3;                          /*!< (@ 0x000000D4) Halt Summary 3                                        */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  SBADDRESS3;                        /*!< (@ 0x000000DC) System Bus Addres 127:96                              */
  __IOM uint32_t  SBCS;                              /*!< (@ 0x000000E0) System Bus Access Control and Status                  */
  __IOM uint32_t  SBADDRESS0;                        /*!< (@ 0x000000E4) System Bus Addres 31:0                                */
  __IOM uint32_t  SBADDRESS1;                        /*!< (@ 0x000000E8) System Bus Addres 63:32                               */
  __IOM uint32_t  SBADDRESS2;                        /*!< (@ 0x000000EC) System Bus Addres 95:64                               */
  __IOM uint32_t  SBDATA0;                           /*!< (@ 0x000000F0) System Bus Data 31:0                                  */
  __IOM uint32_t  SBDATA1;                           /*!< (@ 0x000000F4) System Bus Data 63:32                                 */
  __IOM uint32_t  SBDATA2;                           /*!< (@ 0x000000F8) System Bus Data 95:64                                 */
  __IOM uint32_t  SBDATA3;                           /*!< (@ 0x000000FC) System Bus Data 127:96                                */
  __IOM uint32_t  HALTSUM0;                          /*!< (@ 0x00000100) Halt summary 0                                        */
} NRF_VPR_DEBUGIF_Type;                              /*!< Size = 260 (0x104)                                                   */

/* VPR_DEBUGIF_DATA0: Abstract Data 0. Read/write data for argument 0 */
  #define VPR_DEBUGIF_DATA0_ResetValue (0x00000000UL) /*!< Reset value of DATA0 register.                                      */

