NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* VPR_INTPEND: Pending interrupts */
  #define VPR_INTPEND_ResetValue (0x00000000UL)      /*!< Reset value of INTPEND register.                                     */

/* TRIGGERED16 @Bit 16 : Read pending status of interrupt for event TRIGGERED[16] */
  #define VPR_INTPEND_TRIGGERED16_Pos (16UL)         /*!< Position of TRIGGERED16 field.                                       */
  #define VPR_INTPEND_TRIGGERED16_Msk (0x1UL << VPR_INTPEND_TRIGGERED16_Pos) /*!< Bit mask of TRIGGERED16 field.               */
  #define VPR_INTPEND_TRIGGERED16_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED16 field.                           */
  #define VPR_INTPEND_TRIGGERED16_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED16 field.                           */
  #define VPR_INTPEND_TRIGGERED16_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VPR_INTPEND_TRIGGERED16_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* TRIGGERED17 @Bit 17 : Read pending status of interrupt for event TRIGGERED[17] */
  #define VPR_INTPEND_TRIGGERED17_Pos (17UL)         /*!< Position of TRIGGERED17 field.                                       */
  #define VPR_INTPEND_TRIGGERED17_Msk (0x1UL << VPR_INTPEND_TRIGGERED17_Pos) /*!< Bit mask of TRIGGERED17 field.               */
  #define VPR_INTPEND_TRIGGERED17_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED17 field.                           */
  #define VPR_INTPEND_TRIGGERED17_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED17 field.                           */
  #define VPR_INTPEND_TRIGGERED17_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VPR_INTPEND_TRIGGERED17_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* TRIGGERED18 @Bit 18 : Read pending status of interrupt for event TRIGGERED[18] */
  #define VPR_INTPEND_TRIGGERED18_Pos (18UL)         /*!< Position of TRIGGERED18 field.                                       */
  #define VPR_INTPEND_TRIGGERED18_Msk (0x1UL << VPR_INTPEND_TRIGGERED18_Pos) /*!< Bit mask of TRIGGERED18 field.               */
  #define VPR_INTPEND_TRIGGERED18_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED18 field.                           */
  #define VPR_INTPEND_TRIGGERED18_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED18 field.                           */
  #define VPR_INTPEND_TRIGGERED18_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VPR_INTPEND_TRIGGERED18_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* TRIGGERED19 @Bit 19 : Read pending status of interrupt for event TRIGGERED[19] */
  #define VPR_INTPEND_TRIGGERED19_Pos (19UL)         /*!< Position of TRIGGERED19 field.                                       */
  #define VPR_INTPEND_TRIGGERED19_Msk (0x1UL << VPR_INTPEND_TRIGGERED19_Pos) /*!< Bit mask of TRIGGERED19 field.               */
  #define VPR_INTPEND_TRIGGERED19_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTPEND_TRIGGERED19_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTPEND_TRIGGERED19_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VPR_INTPEND_TRIGGERED19_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* TRIGGERED20 @Bit 20 : Read pending status of interrupt for event TRIGGERED[20] */
  #define VPR_INTPEND_TRIGGERED20_Pos (20UL)         /*!< Position of TRIGGERED20 field.                                       */
  #define VPR_INTPEND_TRIGGERED20_Msk (0x1UL << VPR_INTPEND_TRIGGERED20_Pos) /*!< Bit mask of TRIGGERED20 field.               */
  #define VPR_INTPEND_TRIGGERED20_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTPEND_TRIGGERED20_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTPEND_TRIGGERED20_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VPR_INTPEND_TRIGGERED20_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* TRIGGERED21 @Bit 21 : Read pending status of interrupt for event TRIGGERED[21] */
  #define VPR_INTPEND_TRIGGERED21_Pos (21UL)         /*!< Position of TRIGGERED21 field.                                       */
  #define VPR_INTPEND_TRIGGERED21_Msk (0x1UL << VPR_INTPEND_TRIGGERED21_Pos) /*!< Bit mask of TRIGGERED21 field.               */
  #define VPR_INTPEND_TRIGGERED21_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTPEND_TRIGGERED21_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTPEND_TRIGGERED21_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VPR_INTPEND_TRIGGERED21_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* TRIGGERED22 @Bit 22 : Read pending status of interrupt for event TRIGGERED[22] */
  #define VPR_INTPEND_TRIGGERED22_Pos (22UL)         /*!< Position of TRIGGERED22 field.                                       */
  #define VPR_INTPEND_TRIGGERED22_Msk (0x1UL << VPR_INTPEND_TRIGGERED22_Pos) /*!< Bit mask of TRIGGERED22 field.               */
  #define VPR_INTPEND_TRIGGERED22_Min (0x0UL)        /*!< Min enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTPEND_TRIGGERED22_Max (0x1UL)        /*!< Max enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTPEND_TRIGGERED22_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define VPR_INTPEND_TRIGGERED22_Pending (0x1UL)    /*!< Read: Pending                                                        */


