NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* TASKS2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS2_Pos (2UL)       /*!< Position of TASKS2 field.                                            */
  #define VPRCSR_NORDIC_TASKS_TASKS2_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS2_Pos) /*!< Bit mask of TASKS2 field.              */
  #define VPRCSR_NORDIC_TASKS_TASKS2_Min (0x0UL)     /*!< Min enumerator value of TASKS2 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS2_Max (0x1UL)     /*!< Max enumerator value of TASKS2 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS2_Disabled (0x0UL) /*!< TASKS[2] diabled                                                    */
  #define VPRCSR_NORDIC_TASKS_TASKS2_Enabled (0x1UL) /*!< TASKS[2] enabled                                                     */

/* TASKS3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS3_Pos (3UL)       /*!< Position of TASKS3 field.                                            */
  #define VPRCSR_NORDIC_TASKS_TASKS3_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS3_Pos) /*!< Bit mask of TASKS3 field.              */
  #define VPRCSR_NORDIC_TASKS_TASKS3_Min (0x0UL)     /*!< Min enumerator value of TASKS3 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS3_Max (0x1UL)     /*!< Max enumerator value of TASKS3 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS3_Disabled (0x0UL) /*!< TASKS[3] diabled                                                    */
  #define VPRCSR_NORDIC_TASKS_TASKS3_Enabled (0x1UL) /*!< TASKS[3] enabled                                                     */

/* TASKS4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS4_Pos (4UL)       /*!< Position of TASKS4 field.                                            */
  #define VPRCSR_NORDIC_TASKS_TASKS4_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS4_Pos) /*!< Bit mask of TASKS4 field.              */
  #define VPRCSR_NORDIC_TASKS_TASKS4_Min (0x0UL)     /*!< Min enumerator value of TASKS4 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS4_Max (0x1UL)     /*!< Max enumerator value of TASKS4 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS4_Disabled (0x0UL) /*!< TASKS[4] diabled                                                    */
  #define VPRCSR_NORDIC_TASKS_TASKS4_Enabled (0x1UL) /*!< TASKS[4] enabled                                                     */

/* TASKS5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS5_Pos (5UL)       /*!< Position of TASKS5 field.                                            */
  #define VPRCSR_NORDIC_TASKS_TASKS5_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS5_Pos) /*!< Bit mask of TASKS5 field.              */
  #define VPRCSR_NORDIC_TASKS_TASKS5_Min (0x0UL)     /*!< Min enumerator value of TASKS5 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS5_Max (0x1UL)     /*!< Max enumerator value of TASKS5 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS5_Disabled (0x0UL) /*!< TASKS[5] diabled                                                    */
  #define VPRCSR_NORDIC_TASKS_TASKS5_Enabled (0x1UL) /*!< TASKS[5] enabled                                                     */

/* TASKS6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS6_Pos (6UL)       /*!< Position of TASKS6 field.                                            */
  #define VPRCSR_NORDIC_TASKS_TASKS6_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS6_Pos) /*!< Bit mask of TASKS6 field.              */
  #define VPRCSR_NORDIC_TASKS_TASKS6_Min (0x0UL)     /*!< Min enumerator value of TASKS6 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS6_Max (0x1UL)     /*!< Max enumerator value of TASKS6 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS6_Disabled (0x0UL) /*!< TASKS[6] diabled                                                    */
  #define VPRCSR_NORDIC_TASKS_TASKS6_Enabled (0x1UL) /*!< TASKS[6] enabled                                                     */

/* TASKS7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS7_Pos (7UL)       /*!< Position of TASKS7 field.                                            */
  #define VPRCSR_NORDIC_TASKS_TASKS7_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS7_Pos) /*!< Bit mask of TASKS7 field.              */
  #define VPRCSR_NORDIC_TASKS_TASKS7_Min (0x0UL)     /*!< Min enumerator value of TASKS7 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS7_Max (0x1UL)     /*!< Max enumerator value of TASKS7 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS7_Disabled (0x0UL) /*!< TASKS[7] diabled                                                    */
  #define VPRCSR_NORDIC_TASKS_TASKS7_Enabled (0x1UL) /*!< TASKS[7] enabled                                                     */

/* TASKS8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS8_Pos (8UL)       /*!< Position of TASKS8 field.                                            */
  #define VPRCSR_NORDIC_TASKS_TASKS8_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS8_Pos) /*!< Bit mask of TASKS8 field.              */
  #define VPRCSR_NORDIC_TASKS_TASKS8_Min (0x0UL)     /*!< Min enumerator value of TASKS8 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS8_Max (0x1UL)     /*!< Max enumerator value of TASKS8 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS8_Disabled (0x0UL) /*!< TASKS[8] diabled                                                    */
  #define VPRCSR_NORDIC_TASKS_TASKS8_Enabled (0x1UL) /*!< TASKS[8] enabled                                                     */

/* TASKS9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS9_Pos (9UL)       /*!< Position of TASKS9 field.                                            */
  #define VPRCSR_NORDIC_TASKS_TASKS9_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS9_Pos) /*!< Bit mask of TASKS9 field.              */
  #define VPRCSR_NORDIC_TASKS_TASKS9_Min (0x0UL)     /*!< Min enumerator value of TASKS9 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS9_Max (0x1UL)     /*!< Max enumerator value of TASKS9 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS9_Disabled (0x0UL) /*!< TASKS[9] diabled                                                    */
  #define VPRCSR_NORDIC_TASKS_TASKS9_Enabled (0x1UL) /*!< TASKS[9] enabled                                                     */

