NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_DIR_PIN8_Pos (8UL)           /*!< Position of PIN8 field.                                              */
  #define VPRCSR_NORDIC_DIR_PIN8_Msk (0x1UL << VPRCSR_NORDIC_DIR_PIN8_Pos) /*!< Bit mask of PIN8 field.                        */
  #define VPRCSR_NORDIC_DIR_PIN8_Min (0x0UL)         /*!< Min enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_DIR_PIN8_Max (0x1UL)         /*!< Max enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_DIR_PIN8_INPUT (0x0UL)       /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIR_PIN8_OUTPUT (0x1UL)      /*!< Pin is set as output                                                 */

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_DIR_PIN9_Pos (9UL)           /*!< Position of PIN9 field.                                              */
  #define VPRCSR_NORDIC_DIR_PIN9_Msk (0x1UL << VPRCSR_NORDIC_DIR_PIN9_Pos) /*!< Bit mask of PIN9 field.                        */
  #define VPRCSR_NORDIC_DIR_PIN9_Min (0x0UL)         /*!< Min enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_DIR_PIN9_Max (0x1UL)         /*!< Max enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_DIR_PIN9_INPUT (0x0UL)       /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIR_PIN9_OUTPUT (0x1UL)      /*!< Pin is set as output                                                 */

/* PIN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_DIR_PIN10_Pos (10UL)         /*!< Position of PIN10 field.                                             */
  #define VPRCSR_NORDIC_DIR_PIN10_Msk (0x1UL << VPRCSR_NORDIC_DIR_PIN10_Pos) /*!< Bit mask of PIN10 field.                     */
  #define VPRCSR_NORDIC_DIR_PIN10_Min (0x0UL)        /*!< Min enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_DIR_PIN10_Max (0x1UL)        /*!< Max enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_DIR_PIN10_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIR_PIN10_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_DIR_PIN11_Pos (11UL)         /*!< Position of PIN11 field.                                             */
  #define VPRCSR_NORDIC_DIR_PIN11_Msk (0x1UL << VPRCSR_NORDIC_DIR_PIN11_Pos) /*!< Bit mask of PIN11 field.                     */
  #define VPRCSR_NORDIC_DIR_PIN11_Min (0x0UL)        /*!< Min enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_DIR_PIN11_Max (0x1UL)        /*!< Max enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_DIR_PIN11_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIR_PIN11_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_DIR_PIN12_Pos (12UL)         /*!< Position of PIN12 field.                                             */
  #define VPRCSR_NORDIC_DIR_PIN12_Msk (0x1UL << VPRCSR_NORDIC_DIR_PIN12_Pos) /*!< Bit mask of PIN12 field.                     */
  #define VPRCSR_NORDIC_DIR_PIN12_Min (0x0UL)        /*!< Min enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_DIR_PIN12_Max (0x1UL)        /*!< Max enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_DIR_PIN12_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIR_PIN12_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_DIR_PIN13_Pos (13UL)         /*!< Position of PIN13 field.                                             */
  #define VPRCSR_NORDIC_DIR_PIN13_Msk (0x1UL << VPRCSR_NORDIC_DIR_PIN13_Pos) /*!< Bit mask of PIN13 field.                     */
  #define VPRCSR_NORDIC_DIR_PIN13_Min (0x0UL)        /*!< Min enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_DIR_PIN13_Max (0x1UL)        /*!< Max enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_DIR_PIN13_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIR_PIN13_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_DIR_PIN14_Pos (14UL)         /*!< Position of PIN14 field.                                             */
  #define VPRCSR_NORDIC_DIR_PIN14_Msk (0x1UL << VPRCSR_NORDIC_DIR_PIN14_Pos) /*!< Bit mask of PIN14 field.                     */
  #define VPRCSR_NORDIC_DIR_PIN14_Min (0x0UL)        /*!< Min enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_DIR_PIN14_Max (0x1UL)        /*!< Max enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_DIR_PIN14_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIR_PIN14_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_DIR_PIN15_Pos (15UL)         /*!< Position of PIN15 field.                                             */
  #define VPRCSR_NORDIC_DIR_PIN15_Msk (0x1UL << VPRCSR_NORDIC_DIR_PIN15_Pos) /*!< Bit mask of PIN15 field.                     */
  #define VPRCSR_NORDIC_DIR_PIN15_Min (0x0UL)        /*!< Min enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_DIR_PIN15_Max (0x1UL)        /*!< Max enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_DIR_PIN15_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIR_PIN15_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */


/**
  * @brief IN [VPRCSR_NORDIC_IN] GPIO Input. Real Time Peripherals VIO.
  */
  #define VPRCSR_NORDIC_IN (0x00000BC2ul)
  #define VPRCSR_NORDIC_IN_ResetValue (0x00000000UL) /*!< Reset value of IN register.                                          */

