NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20b_types.h
/* EVENTS_VBUSDETECTED @Bit 0 : VBUS detected */
  #define VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_Pos (0UL) /*!< Position of EVENTS_VBUSDETECTED field.                */
  #define VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_Msk (0x1UL << VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_Pos)
                                                                            /*!< Bit mask of EVENTS_VBUSDETECTED field.*/
  #define VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_VBUSDETECTED field.  */
  #define VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_VBUSDETECTED field.  */
  #define VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_Generated (0x1UL) /*!< Event generated                               */


/* VREGUSB_EVENTS_VBUSREMOVED: VBUS removed */
  #define VREGUSB_EVENTS_VBUSREMOVED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_VBUSREMOVED register.                */

/* EVENTS_VBUSREMOVED @Bit 0 : VBUS removed */
  #define VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_Pos (0UL) /*!< Position of EVENTS_VBUSREMOVED field.                   */
  #define VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_Msk (0x1UL << VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_Pos) /*!<
                                                                            Bit mask of EVENTS_VBUSREMOVED field.*/
  #define VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_Min (0x0UL) /*!< Min enumerator value of EVENTS_VBUSREMOVED field.     */
  #define VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_Max (0x1UL) /*!< Max enumerator value of EVENTS_VBUSREMOVED field.     */
  #define VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_Generated (0x1UL) /*!< Event generated                                 */


/* VREGUSB_INTEN: Enable or disable interrupt */
  #define VREGUSB_INTEN_ResetValue (0x00000000UL)    /*!< Reset value of INTEN register.                                       */

/* VBUSDETECTED @Bit 1 : Enable or disable interrupt for event VBUSDETECTED */
  #define VREGUSB_INTEN_VBUSDETECTED_Pos (1UL)       /*!< Position of VBUSDETECTED field.                                      */
  #define VREGUSB_INTEN_VBUSDETECTED_Msk (0x1UL << VREGUSB_INTEN_VBUSDETECTED_Pos) /*!< Bit mask of VBUSDETECTED field.        */
  #define VREGUSB_INTEN_VBUSDETECTED_Min (0x0UL)     /*!< Min enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTEN_VBUSDETECTED_Max (0x1UL)     /*!< Max enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTEN_VBUSDETECTED_Disabled (0x0UL) /*!< Disable                                                             */
  #define VREGUSB_INTEN_VBUSDETECTED_Enabled (0x1UL) /*!< Enable                                                               */

/* VBUSREMOVED @Bit 4 : Enable or disable interrupt for event VBUSREMOVED */
  #define VREGUSB_INTEN_VBUSREMOVED_Pos (4UL)        /*!< Position of VBUSREMOVED field.                                       */
  #define VREGUSB_INTEN_VBUSREMOVED_Msk (0x1UL << VREGUSB_INTEN_VBUSREMOVED_Pos) /*!< Bit mask of VBUSREMOVED field.           */
  #define VREGUSB_INTEN_VBUSREMOVED_Min (0x0UL)      /*!< Min enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTEN_VBUSREMOVED_Max (0x1UL)      /*!< Max enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTEN_VBUSREMOVED_Disabled (0x0UL) /*!< Disable                                                              */
  #define VREGUSB_INTEN_VBUSREMOVED_Enabled (0x1UL)  /*!< Enable                                                               */


/* VREGUSB_INTENSET: Enable interrupt */
  #define VREGUSB_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                    */

/* VBUSDETECTED @Bit 1 : Write '1' to enable interrupt for event VBUSDETECTED */
  #define VREGUSB_INTENSET_VBUSDETECTED_Pos (1UL)    /*!< Position of VBUSDETECTED field.                                      */
  #define VREGUSB_INTENSET_VBUSDETECTED_Msk (0x1UL << VREGUSB_INTENSET_VBUSDETECTED_Pos) /*!< Bit mask of VBUSDETECTED field.  */
  #define VREGUSB_INTENSET_VBUSDETECTED_Min (0x0UL)  /*!< Min enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTENSET_VBUSDETECTED_Max (0x1UL)  /*!< Max enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTENSET_VBUSDETECTED_Set (0x1UL)  /*!< Enable                                                               */
  #define VREGUSB_INTENSET_VBUSDETECTED_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define VREGUSB_INTENSET_VBUSDETECTED_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* VBUSREMOVED @Bit 4 : Write '1' to enable interrupt for event VBUSREMOVED */
  #define VREGUSB_INTENSET_VBUSREMOVED_Pos (4UL)     /*!< Position of VBUSREMOVED field.                                       */
  #define VREGUSB_INTENSET_VBUSREMOVED_Msk (0x1UL << VREGUSB_INTENSET_VBUSREMOVED_Pos) /*!< Bit mask of VBUSREMOVED field.     */
  #define VREGUSB_INTENSET_VBUSREMOVED_Min (0x0UL)   /*!< Min enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTENSET_VBUSREMOVED_Max (0x1UL)   /*!< Max enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTENSET_VBUSREMOVED_Set (0x1UL)   /*!< Enable                                                               */
  #define VREGUSB_INTENSET_VBUSREMOVED_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define VREGUSB_INTENSET_VBUSREMOVED_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* VREGUSB_INTENCLR: Disable interrupt */
  #define VREGUSB_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                    */

/* VBUSDETECTED @Bit 1 : Write '1' to disable interrupt for event VBUSDETECTED */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Pos (1UL)    /*!< Position of VBUSDETECTED field.                                      */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Msk (0x1UL << VREGUSB_INTENCLR_VBUSDETECTED_Pos) /*!< Bit mask of VBUSDETECTED field.  */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Min (0x0UL)  /*!< Min enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Max (0x1UL)  /*!< Max enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Clear (0x1UL) /*!< Disable                                                             */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* VBUSREMOVED @Bit 4 : Write '1' to disable interrupt for event VBUSREMOVED */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Pos (4UL)     /*!< Position of VBUSREMOVED field.                                       */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Msk (0x1UL << VREGUSB_INTENCLR_VBUSREMOVED_Pos) /*!< Bit mask of VBUSREMOVED field.     */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Min (0x0UL)   /*!< Min enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Max (0x1UL)   /*!< Max enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Clear (0x1UL) /*!< Disable                                                              */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* VREGUSB_INTPEND: Pending interrupts */
  #define VREGUSB_INTPEND_ResetValue (0x00000000UL)  /*!< Reset value of INTPEND register.                                     */

/* VBUSDETECTED @Bit 1 : Read pending status of interrupt for event VBUSDETECTED */
  #define VREGUSB_INTPEND_VBUSDETECTED_Pos (1UL)     /*!< Position of VBUSDETECTED field.                                      */
  #define VREGUSB_INTPEND_VBUSDETECTED_Msk (0x1UL << VREGUSB_INTPEND_VBUSDETECTED_Pos) /*!< Bit mask of VBUSDETECTED field.    */
  #define VREGUSB_INTPEND_VBUSDETECTED_Min (0x0UL)   /*!< Min enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTPEND_VBUSDETECTED_Max (0x1UL)   /*!< Max enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTPEND_VBUSDETECTED_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define VREGUSB_INTPEND_VBUSDETECTED_Pending (0x1UL) /*!< Read: Pending                                                      */

/* VBUSREMOVED @Bit 4 : Read pending status of interrupt for event VBUSREMOVED */
  #define VREGUSB_INTPEND_VBUSREMOVED_Pos (4UL)      /*!< Position of VBUSREMOVED field.                                       */
  #define VREGUSB_INTPEND_VBUSREMOVED_Msk (0x1UL << VREGUSB_INTPEND_VBUSREMOVED_Pos) /*!< Bit mask of VBUSREMOVED field.       */
  #define VREGUSB_INTPEND_VBUSREMOVED_Min (0x0UL)    /*!< Min enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTPEND_VBUSREMOVED_Max (0x1UL)    /*!< Max enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTPEND_VBUSREMOVED_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define VREGUSB_INTPEND_VBUSREMOVED_Pending (0x1UL) /*!< Read: Pending                                                       */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct WDT ======================================================== */
/**
  * @brief Watchdog Timer
  */
  typedef struct {                                   /*!< WDT Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start WDT                                             */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop WDT                                              */
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_TIMEOUT;                   /*!< (@ 0x00000100) Watchdog timeout                                      */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) Watchdog stopped                                      */
    __IM uint32_t RESERVED2[30];
    __IOM uint32_t PUBLISH_TIMEOUT;                  /*!< (@ 0x00000180) Publish configuration for event TIMEOUT               */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000184) Publish configuration for event STOPPED               */
    __IM uint32_t RESERVED3[94];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED4[4];
    __IOM uint32_t NMIEN;                            /*!< (@ 0x00000320) Enable or disable interrupt                           */
    __IOM uint32_t NMIENSET;                         /*!< (@ 0x00000324) Enable interrupt                                      */
    __IOM uint32_t NMIENCLR;                         /*!< (@ 0x00000328) Disable interrupt                                     */
    __IM uint32_t RESERVED5[53];
    __IM uint32_t RUNSTATUS;                         /*!< (@ 0x00000400) Run status                                            */
    __IM uint32_t REQSTATUS;                         /*!< (@ 0x00000404) Request status                                        */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t CRV;                              /*!< (@ 0x00000504) Counter reload value                                  */
    __IOM uint32_t RREN;                             /*!< (@ 0x00000508) Enable register for reload request registers          */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x0000050C) Configuration register                                */
    __IM uint32_t RESERVED7[4];
    __OM uint32_t TSEN;                              /*!< (@ 0x00000520) Task stop enable                                      */
    __IM uint32_t RESERVED8[55];
    __OM uint32_t RR[8];                             /*!< (@ 0x00000600) Reload request n                                      */
  } NRF_WDT_Type;                                    /*!< Size = 1568 (0x620)                                                  */

